/* ==================================================
   TELEGRAM
================================================== */
const tg = window.Telegram?.WebApp;
if (tg) {
   tg.ready();
   tg.expand();

if (tg.setHeaderColor) {tg.setHeaderColor("#CCCCFF");}

if (tg.setBackgroundColor) {tg.setBackgroundColor("#CCCCFF");}
}

/* ==================================================
   мотивационные фразы
================================================== */

const quotes = [
"срыв — не повод бросать все",

"лучшая мотивация — это шмотки, которые лежат в шкафу и ждут, когда ты в них влезешь",

"твой самый трудный день не отменяет весь путь, который был пройден",

"в любой непонятной ситуации — ложись спать, ведь во сне невозможно пойти к холодильнику",

"не делай покупку абонемента в зал своим любимым видом благотворительности",

"тебе можно уставать и остановиться",

"минутная слабость во рту не стоит часов разочарования перед зеркалом",

"дисциплина — это решение делать то, чего ты не хочешь, чтобы достичь того, чего ты хочешь больше всего",

"сделай свое тело местом, в котором тебе приятно жить",

"уважение к себе начинается с того, чем ты наполняешь свой день и свою тарелку",

"твоя лень не сделает тебя увереннее в себе",

"перестань искать «идеальный понедельник»! идеального времени не будет никогда, есть только здесь и сейчас"
];

let currentQuote = 0;


/* ==================================================
 разделы скролл-кнопок
================================================== */

const sections = {
/*калькуляторы*/
tools:  {
title: "твой виртуальный счетовод",
kicker: "dietary calculations",
description: "расчет твоего личного ИМТ и счетчик дефицита калорий",
topics: []
        },

/*ссылки на соцсетки*/
links:  {
title: "все ссылки",
category: "links",
pages:  [
        {
content: `
           <div class="official-links">
          <a
            class="official-link-card"
            href="https://t.me/+8m49Mte-Um5lMGUy"
            target="_blank"
            rel="noopener noreferrer"
           >
            <div class="official-link-icon">✦</div>
            <div class="official-link-info">
              <strong>основной Telegram-канал</strong>
              <span>публикуем новые артикулы ежедневно</span>
            </div>
            <span class="official-link-arrow">→</span>
          
          <a
            class="official-link-card"
            href="https://t.me/+77xMDKXa0Zk3MTIy"
            target="_blank"
            rel="noopener noreferrer"
          >
            <div class="official-link-icon">☁</div>
            <div class="official-link-info">
              <strong>общий чат</strong>
              <span>самый лояльный чат, где тебя поддержат и помогут</span>
            </div>
            <span class="official-link-arrow">→</span>
    
          <a
            class="official-link-card"
            href="https://t.me/+v9wqv4HaBlIxNjBi"
            target="_blank"
            rel="noopener noreferrer"
          >
            <div class="official-link-icon">♡</div>
            <div class="official-link-info">
              <strong>канал с информацией</strong>
              <span>не менее важный и информативный тгк</span>
            </div>
            <span class="official-link-arrow">→</span>
          
          <a
            class="official-link-card"
            href="https://t.me/anonaskbot?start=molecule"
            target="_blank"
            rel="noopener noreferrer"
          >
            <div class="official-link-icon">?</div>
            <div class="official-link-info">
              <strong>анонимный бот</strong>
              <span>задай вопрос или предложи тему для поста</span>
            </div>
            <span class="official-link-arrow">→</span>
        
          <a
            class="official-link-card"
            href="https://www.tiktok.com/@arttmolecule1?_r=1"
            target="_blank"
            rel="noopener noreferrer"
          >
            <div class="official-link-icon">♪</div>
            <div class="official-link-info">
              <strong>TikTok</strong>
              <span>тикитоки, шутки, сотрудничество</span>
            </div>
            <span class="official-link-arrow">→</span>
          
          <div class="official-links-warning">
          <div class="official-links-warning-title">
              ⚠ не наткнись на мошенников!
          </div>
            <p>
            все ссылки в этом разделе — наши официальные соц.сети
            </p>
            <p>
            ссылки, которые не были опубликованы здесь – <b>мошеннические!</b>
            </p>
          </div>
          </div>            
       `
       }
       ]
       }, 
   
/*бибилиотека бадов*/
supplements: {
title: "БАДовый минимум знаний",
kicker: "basic information",
description: "..и роскошный максимум информации",
topics: [
        { id: "supplements-basic",
          title: "База всех БАДов",
          description: "побочки, противопоказания, плато",
        },  
        { id: "supplements-scam",
          title: "Мифы из интернета",
          description: "легенда про сибутрамин и Германию",
        },    
        { id: "supplements-plus",
          title: "Molecule Plus",
          description: "",
        },
        { id: "supplements-prem",
          title: "Molecule Premium",
          description: "",
        },
        { id: "supplements-ultra",
          title: "Molecule Ultra",
          description: "",
        },   
        { id: "supplements-zb",
          title: "Molecule ЖБ",
          description: "",
        },
        { id: "supplements-supressa",
          title: "Supressa",
          description: "",
        },
        { id: "supplements-mineral",
          title: "Mineral",
          description: "",
        },
        { id: "supplements-heedly",
          title: "Heedly Slim-Complex",
          description: "",
        },
        { id: "supplements-reducsin",
          title: "Редуксин",
          description: "",
        },   
        { id: "supplements-swapx",
          title: "Swap-X Neo / Pro",
          description: "",
        },
        { id: "supplements-ozempic",
          title: "Turbo Ozempic",
          description: "",
        }   
        ]
        },
   
/*медицинские темы*/
medical:{
title: "Молекулярная медицина",
kicker: "medicine",
description: "разбираемся, что происходит с организмом на курсе на самом деле без советов и страшилок из интернета",
topics: [
        { id: "medical-tests",
          title: "Видно ли БАДы для похудения в анализах",
          description: "общие анализы, медкомиссия и тесты на вещ-ва"
        },
        { id: "medical-disorders",
          title: "БАДы и расстройства психики",
          description: "как стимуляторы могут влиять на ментальное состояние"
        },
        { id: "medical-vitamins",
          title: "Витамины и лечебные препараты",
          description: "какие витамины и лекарства можно пить, а какие категорически нет"
        }
        ]
        },
   
/*темы про месяки и запоры*/
delicate: {
title: "Деликатные темы",
kicker: "delicate",
description: "все мы живые люди, а значит неидеальные<br>тут обсудим темы, которые не принято поднимать даже в чате",
topics: [
        { id: "delicate-period",
          title: "Менструация на курсе",
          description: "какой должен быть перерыв, твои фазы и противопоказания"
        },
        { id: "delicate-constipation",
          title: "Запоры",
          description: "из-за чего, что можно есть, чтобы облегчить, white/black-list слабительных"
        }
        ]
        },
   
/*рпп база*/   
rpp:   {
title: "Разбираемся в рпп",
kicker: "eating disorder",
description: "повторяем теорию, затрагиваем ремиссию и немного изучаем привычки",
topics: [
        { id: "rpp-basics",
          title: "База рпп",
          description: "теория, которую все знают"
        },
        { id: "rpp-thoughts",
          title: "Дьявол в деталях",
          description: "привычки, «чистая» и «грязная» еда"
        },
        { id: "rpp-cycle",
          title: "Вечный круговорот",
          description: "существует ли ремиссия и можно ли вылечиться навсегда?"
        }
        ]
        },
   
/*уход за волосами, ногтями, зубами, кожей*/   
care: {
title: "Молекулярный уход",
kicker: "care",
description: "похудение в целом бьет по многим отделам организма, но чаще всего страдает именно оболочка",
topics: [
        { id: "care-teeth",
          title: "Зубы",
          description: "реально ли лишиться зубов на похудении и так ли нужен кальций как его советуют"
        },
        { id: "care-skin",
          title: "Кожа",
          description: "почему все проблемы с организмом – на лицо?"
        },
        { id: "care-hair",
          title: "Волосы",
          description: "что делать если мысли о стрижке вгоняют в панику, а волосы на расческе – в депрессию"
        }
        ]
        },

/*кнопка дневника на главной*/      
mood:   {
title: "дневник настроения",
kicker: "mood journal",
description: "личные заметки и мысли — в одном спокойном месте",
topics: []
        },
        };


/* ==================================================
      СТАТЬИ
================================================== */
   const articles = {

/*--------------------------
    Общие правила БАДов
--------------------------*/
      
  "supplements-basic": {

section: "supplements",
title: "Побочки, противопоказания, плато",
category: "База всех БАДов",
pages:  [
        {
heading: "Побочные эффекты большинства БАДов",
content:`
          <div class="info-box">
          БАДы могут отличаться составом, действующим веществом и дозировкой, <b>но большинство побочных
          эффектов всегда совпадают</b>
          </div>

          <img src="./images/upackovki.jpg"
          alt="upackovki" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 

<h3>⟣Сухость во рту⟢</h3>
          <p>
          Кофеин/экстракт кофе в составе большинства БАДов вытягивает воду из всего организма
          </p>
          
          <img src="./images/waterbottles.JPG"
          alt="upackovki" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">           

<h3>⟣Бессонница⟢</h3>
          <p>
          Концентрация стимуляторов в составах дает дополнительный прилив энергии, чтобы иметь
          силы функционировать на дефиците/недостатке энергии из калорий
          </p>
          <p>
          Именно поэтому мы рекомендуем пить БАДы для похудения не позднее, чем за 7-8 часов
          до сна
          </p>
          <img src="./images/IMG_6237.jpg"
          alt="бессонница" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 

<h3>⟣Увеличение потоотделения⟢</h3>
          <p>
          Кофеин вызывает повышение норадреналина в крови, который запускает симпатичесую систему "бей или беги"
          и повышает "стрессовое" потоотделение, которое еще называют "холодный пот"
          </p>
          <img src="./images/IMG_6238.JPG"
          alt="пот" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 

<h3>⟣Тахикардия и увеличение ЧСС⟢</h3>
          <p>
          По той же причине кофеин выбрасывает в кровь норадреналин и кортизол, которые запускают
          симпатическую систему "выживания", а она в свою очередь увеличивает частоту сердечных сокращений
          </p>
          <img src="./images/IMG_6240.JPG"
          alt="сердешко" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 

<h3>⟣Потемнение в глазах и обмороки⟢</h3>
          <p>
          Кофеин способствует мочегонному эффекту и обезвоживанию, а вместе с водой выводятся жизненно важные электролиты,
          что способствует данным побочным эффектам
          </p>
          <p>
          В тяжелых случаях может вызывать тремор и судороги конечностей, кратковременное онемение языка
          </p>
          <img src="./images/IMG_6241.JPG"
          alt="обморок" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 

<h3>⟣Запоры⟢</h3>
          <p>
          Так как кофеин высасывает воду из всего организма, то это касается и кишечника,
          для которого наличие воды — важный фактор для его опустошения
          </p>
          <p>
          Обезвоживание приводит к замедлению работы перистальтики и застою содержимого кишечного тракта
          </p>
          <img src="./images/IMG_6243.jpg"
          alt="запор" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 

<h3>⟣Провалы в памяти/отсутствие концентрации⟢</h3>
          <p>
          Могут быть вызваны некоторыми вышеперечисленными факторами, например, бессонницей
          или слишком высоким дефицитом калорий/голодания
          </p>
          <img src="./images/IMG_6242.jpg"
          alt="память" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
        `
        },               

        {
heading: "Общие противопоказания",
content:`          
<h2>➀ Нарушения сердечно-сосудистой системы</h2>
          <img src="./images/IMG_6246.jpg"
          alt="сердечко" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h3>✧ Гипертония</h3>
          <p>
          Высокое содержание кофеина в БАДах стимулирует выброс норадреналина,
          что напрямую повышает артериальное давление и может привести к гипертоническому кризу
          (критически высокое давление)
          </p>
          
<h3>✧ Аритмия</h3>
          <p>
           Ускоряет пульс и влияет на проводимость сердца, что способно спровоцировать тяжелые,
           жизнеугрожающие сбои сердечного ритма
          </p>
           
<h3>✧ Ишемическая болезнь сердца</h3>
          <p>
           Из-за учащения пульса возрастает потребность миокарда в кислороде,
           что вызывает или усиливает приступы стенокардии
          </p>
           
<h3>✧ Перенесенные инсульт или инфаркт</h3>
          <p>
          Кофеин сужает сосуды и увеличивает нагрузку на сердце, резко повышая риск повторения приступа
          </p>
          <br>

<h2>➁ Нарушения эндокринной системы</h2>
          <img src="./images/IMG_6247.jpg"
          alt="скальпель" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
          
<h3>✧ Болезни щитовидной железы (гипер- и гипотиреоз)</h3>
          <p>
          При гипертиреозе препарат усугубит опасную нагрузку на сердце (тахикардию)
          <br>
          При гипотиреозе избыточный вес имеет другую природу и требует лечения гормонами, а не БАДами
          </p>
          
<h3>✧ Сахарный диабет (особенно 2 типа)</h3>
          <p>
          Прием может спровоцировать резкие скачки глюкозы и тяжелую гипогликемию на фоне дефицита калорий
          </p>
          
<h3>✧ Гормональные нарушения</h3>
          <p>
          Прием может исказить клиническую картину, усугубить дисбаланс и сделать лечение
          гормонального сбоя бесполезным
          </p>
          <br>

<h2>➂ Нарушение работы печени и почек</h2>
          <img src="./images/IMG_6248.jpg"
          alt="руки" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h3>✧ Гепатит</h3>
          <p>
          Воспаленная печень не справляется с метаболизмом кофеина в составе,
          что усиливает токсическую нагрузку и повреждает ее клетки
          </p>
          
<h3>✧ ﻿﻿Жировой гепатоз</h3>
          <p>
          При сниженной функции печени замедляется выведение действующих веществ,
          что может привести к их накоплению в организме и усилению побочных эффектов
          </p>
          
<h3>﻿✧ Почечная недостаточность</h3>
          <p>
          Замедление выведения продуктов распада БАДов через почки приводит к попаданию их токсичной
          концентрации в кровь
          </p>
          <br>

<h2>➃ Общие нарушения организма</h2>
          <img src="./images/IMG_6249.JPG"
          alt="лаборатория" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
          
<h3>✧ Глаукома</h3>
          <p>
          Кофеин вызывает расширение зрачков (мидриаз), что нарушает отток внутриглазной жидкости
          и может критически повысить внутриглазное давление
          </p>
          
<h3>✧ Анемия</h3>
          <p>
          БАДы снижают аппетит, что усугубит дефицит железа и питательных веществ, ухудшая кроветворение
          </p>
          
<h3>✧ Заболевания ЖКТ в стадии обострения</h3>
          <p>
          Кофеин в составе влияет на работу ЖКТ и выделение желчи, 
          что может усилить боли, вызвать спазмы или спровоцировать обострение язвенных процессов
          </p>
          
<h3>✧ Беременность/лактация</h3>
          <p>
          кофеин в больших количествах токсичен для плода и проникает в грудное молоко, 
          создавая прямую угрозу здоровью и развитию ребенка
          </p>
          
<h3>✧ ﻿﻿Возраст ниже 16 лет</h3>
          <p>
          возможно слишком быстрое развитие толерантности ввиду растущего организма
          и несформированной гормональной системы
          </p>
          
<h3>﻿✧ Любые серьезные заболевания</h3>
          <p>
          тяжелые патологии истощают организм, а БАДы создают дополнительный системный стресс
          </p>
          
<h3>✧ ﻿Аллергия на компоненты</h3>
          <p>
          может спровоцировать опасные иммунные ответы:
          <br>
          от острой кожной сыпи до отека Квинке и анафилактического шока
          </p>
        `
        }, 
   
        {
heading: "Плато",
content:`

<h2>Что следует помнить:</h2>
          <div class="info-box">
          Самой частой причиной отсутствия отвесов на курсе является слишком маленький срок приема БАДа
          </div>
          <div class="info-box">
          Любой БАД для похудения не даст тебе -10 килограммов за один-три дня курса, это физически <b>невозможно</b>
          </div>

<h2>Что это такое?</h2>
          <p>
          <b><i>Плато</i></b> — это остановка прогресса, когда результаты замерли на одном месте, будь то сброс или наоборот набор веса
          </p>
          <p>
          А чтобы сдвинуться с мертвой точки, нужно изменить привычную нагрузку, рацион или режим отдыха
          </p>
          
          <img src="./images/IMG_6250.jpg"
          alt="пробирки" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
          
<h2>Какие могут быть причины остановки веса?</h2>
<h3>➀ Неправильно рассчитанный дефицит калорий</h3>
          <p>
          <b> ᛫ Если дефицит слишком высокий:</b>
          <br>
          замедляется обмен веществ и метаболизм, так
          как организм испытывает стресс и включает режим "энергосбережения"
          </p>
          <div class="info-box">
          <p>
          Калораж менее 1000кк в день чреват дальнейшими срывами и перееданиями
          </p>
          </div>
          <p>
          <b> ・ Если дефицит слишком низкий:</b>
          <br>
          организм воспринимает низкий дефицит(менее 10% от bmi) как обычный дневной обмен веществ,
          не запускает процесс похудения и даже БАДы не способны будут помочь
          </p>
          
<h3>➁ Недостаточное количество выпиваемой жидкости в сутки</h3>
          <p>
          ✧ Отсутствие нормального количества чистой воды = отеки
          <br>
          ✧ Замедление работы перистальтики(запоры)   
          <br>
          ✧ Недостаток электролитов в организме(тремор, головокружения, слабость)
          <br>
          ✧ Обезвоживание(тошнота, головная боль, ощущение кома в горле)
          <br>
          ✧ Недостаток вырабатываемой слюны(боль в деснах и зубах, шаткость зубов, смягчение и разрушение эмали)
          </p>

<h3>➂ Отсутствие перерывов и отдыха между занятиями физнагрузкой</h3>
          <p>
          После интенсивной нагрузки, например кардиотренировки, мышцы напрягаются от полученных микротравм и,
          чтобы быстрее восстановиться, задерживают внутри себя воду, что приводит к увеличению цифры на весах
          до полного восстановления и расслабления мышечной ткани(2-5 суток)
          </p>
          
          <div class="info-box">
          <p>
          При отсутствии разгрузочного от тренировок дня, мышцы просто не успевают восстановиться
          и с каждой нагрузкой задерживают воду в бóльших объемах
          </p>
          </div>

<h3>➃ Выработанная толерантность из-за отсутствия необходимого перерыва между курсами БАДов</h3>
          <p>
          <b><i>Толерантность</i></b> — это фармакологическое явление, когда твой организм привыкает к ежедневной дозе какого-либо
          препарата, который вскоре перестает действовать
          </p>
          
          <p>
          <b>Для возобновления эффекта с каждым разом будет требоваться все более высокая доза</b>
          </p>

<h3>➄ Недосыпы</h3>
          <p>
          Недостаточное количество сна (7-9 часов) не дает твоему организму правильно и плодотворно отдохнуть:
          <br>
          ✧ Растет грелин — гормон голода, который вырабатывается в желудке
          <br>
          ✧ Повышается тяга к сладкому, потому что колеблется инсулин
          <br>
          ✧ Растет кортизол — гормон стресса, который задерживает воду и вызывает отеки
          <br>
          ✧ Падают силы на более высокий расход энергии (меньше спишь → меньше сил на тренировки)
          <br>
          <div class="info-box">
          Перерывы между курсами крайне необходимы для того, чтобы твой организм успевал
          перезагрузиться, отдохнуть, накопить новые ресурсы перед дефицитом калорий и ударной дозой кофеина
          </div>
          </p>
          
<h3>➅ Индивидуальная реакция организма, если он еще в процессе роста</h3>
          <p>
          Чем старше и более сформирован твой организм, тем менее он подвержен толерантности и адаптации к
          восприимчивости абсолютно любого БАДа
          </p>
          <p>
          Именно поэтому большинство жалующихся на отсутствие результата — <b>молодые люди</b>, организм которых еще
          развивается и формируется, что делает его:
          <br>
          ✧ Более гибким
          <br>
          ✧ Толерантность более высокой
          <br>
          ✧ Накопительный эффект в тканях низким
          <br>
          ✧ Чувствительность(побочные эффекты) минимальной
          </p>

<h3>➆ Игнорирование диагнозов из перечня противопоказаний</h3>
          <p>
          В списке противопоказаний есть конкретный список диагнозов, при которых прием БАДов для похудения:
          <br>
          ✧ Категорически запрещен
          <br>
          ✧ Не рекомендуется
          <br>
          ✧ Разрешен, но с особыми условиями
          </p>
          
          <div class="info-box">
          <p>
          Игнорирование своего диагноза в любом из этих перечней ведет к <b>неизвестным последствиям</b>
          </p>
          </div>

<h3>➇ Эмоциональный/стрессовый голод</h3>
          <p>
          Ощущение голода и высокий аппетит на фоне стресса/скуки = <b>нарушение в работе естественной
          цепочки реакций на выработку кортизола и адреналина</b>
          </p>
          <div class="info-box">
          <p>
          ⚠ Такие проблемы БАДы <b>НЕ решают</b>, с этим работают квалифицированные специалисты
          </p>
          </div>
        `  
        },

        {
heading: "Как избежать плато?",
content:`

<h2>🍏 Неправильный дефицит</h2>
          <p>
          Самая точная формула для расчета своего дефицита калорий — <b>формула Миффлина-Сен Жеора</b>
          <br>
          Она отнимает безопасные 20% от твоего дневного обмена веществ для похудения
          </p>
          <div class="info-box">
          <p>
          Рассчитать по этой формуле свой дефицит ты можешь в разделе калькуляторы
          </p>
          </div>

<h2>💧 Недостаточное количество воды</h2>
          <p>
          Правильно рассчитать свою норму выпиваемой воды в сутки:
          </p>
          
          <div class="info-box">
          <p>
          35 мл * твой вес в килограммах
          </p>
          </div>
          
<h2>🧘🏻‍♀️ Слишком частые тренировки</h2>
          <p>
          Делай перерывы между днями когда тренируешься с минимальным интервалом
          — «день тренировка/день отдых/день тренировка…»
          </p>

<h2>⏱️ Недостаточное время перерыва</h2>
          <p>
          <b> ᛫ Недостаточный срок перерыва:</b>
          <br>
          ✓ Сделай паузу в приеме всех БАДов на 3-5 суток, а затем начни курс с начальной точки и адаптационного периода
          </p>
          <div class="info-box">
          <p>
          <i>За этот промежуток ферменты успеют вымыться из организма и он будет готов снова плавно входить на курс</i>
          </p>
          </div>
          
          <p>
          <b> ᛫ Отсутствие перерыва:</b>
          <br>
          ✓ Сделай паузу в приеме всех БАДов на 10-14 суток, а затем начни курс с начальной точки и адаптационного периода
          </p>
          <div class="info-box">
          <p>
          <i>За этот промежуток успеют вымыться не только ферменты, но и остаточные метаболиты, что приведет к полному
          очищению организма и готовности начать заново курс</i>
          </p>
          </div>

<h2>💤 Недосып</h2>
          <p>
          Спать не менее 8-9 часов на курсе БАДов
          </p>
          <p>
          Если не получается уснуть, то можно воспользоваться приемом разрешенных седативных/снотворных:
          <br>
          - Мелатонин
          <br>
          - Магний
          <br>
          - Глицин
          <br>
          - Алимемазин
          <br>
          - Доксиламин
          </p>

<h2>🔞 Неподходящий возраст</h2>
          <p>
          К сожалению относительно этой причины <b>мы не сможем дать объективных рекомендаций</b>, кроме одной:       
          </p>
          <div class="info-box">
          <p>
          Отложи прием БАДов до минимального формирования организма (17-19 лет)
          </p>
          </div>

<h2>📋 Пренебрежение противопоказаниями</h2>
          <p>
          Полная отмена БАДа и наблюдение специалиста
          </p> 
          <img src="./images/arttmolecule2.jpg"
          alt="krolik" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">           
        `
        }
        ]
        },

/*--------------------------
        мифы о БАДах
--------------------------*/
      
  "supplements-scam": {

section: "supplements",
title: "Разбиваем мифы о БАДах в щепки",
category: "«какую таблетку выберешь, Нео?»",
pages:  [
        {
heading: "Как связаны Германия, сибутрамин и 2010ый год?",
content:`

<h2>🧬 Что вообще такое сибутрамин?</h2>
          <p>
          <b><i>Сибутрамин</i></b> — это синтетический лекарственный препарат, который разработала
          компания <b>«Knoll Pharmaceuticals»</b> в 1980х годах
          </p>
          <p>
          Изначально его пытались исследовать как антидепрессант, но выраженного антидепрессивного эффекта не получили
          <br>
          Зато, обнаружили сильное снижение аппетита
          </p>
          <p>
          Позже права перешли к <b>«Abbott Laboratories»</b>, которая выпустила его под торговым названием <b>«Meridia»</b>
          (США) и <b>«Reductil»</b> (Европа)
          </p>
          
          <img src="./images/medical.JPG"
          alt="upackovki" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">         
          
<h2>🔬 Как работает сибутрамин?</h2>
          <p>
          Он блокирует обратный захват серотонина, норадреналина и немного дофамина
          </p>
          <p>
          ✦ То есть, является ингибитором обратного захвата моноаминов как многие современные антидепрессанты,
          например эсциталопрам("Элицея")
          </p>
          
<h2>🚑 Его побочные эффекты:</h2>
          <p>
          - быстрое чувство насыщения
          <br>
          - меньше мыслей о еде
          <br>
          - меньше удовольствия от переедания
          <br>
          - больший расход энергии
          <br>
          - повышает давление
          <br>
          - увеличивает пульс
          <br>
          - увеличивает нагрузку на сердце
          <br>
          - повышает вероятность аритмий
          </p>
          
<h2>〽️ А были ли смерти от сибутрамина?</h2>
          <p>
          <b>Да, были</b>
          </p>
          <p>
          Зарегистрированы случаи:
          <br>
          - внезапной сердечной смерти
          <br>
          - инфаркта
          <br>
          - инсульта
          <br>
          - тяжелых аритмий
          </p>
          
          <div class="info-box">
          <p>
          Стоит отметить, что подобные случаи происходили как с людьми со значительными сердечно-сосудистыми
          проблемами, так и с абсолютно здоровыми потребителями
          </p>
          </div>
        `  
        }, 
   
        {
heading: "Как связаны Германия, сибутрамин и 2010ый год?",
content:`

<h2>📆 А что за роковой 2010-ый?</h2>
          <p>
          ✧ <b>В 2010м году</b> сибутрамин официально запретили по всему Евросоюзу, включая Германию, в которой якобы
          и производилась Молекула в 2018-2019 годах <i>(очень сомнительно)</i>
          </p>
          
          <img src="./images/memsiba.jpg"
          alt="upackovki" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
          <p>
          ✦ После крупного исследования специалисты пришли к выводу, что для части пациентов сердечно-сосудистые риски
          оказались слишком серьезными и в октябре 2010 года производители начали вывод с рынка США, а в декабре того
          же года FDA официально отозвало одобрение препарата и после этого в США больше не осталось 
          одобренных препаратов с сибутрамином
          </p>
          <p>
          ⌬ Поэтому когда появились серьезные данные о безопасности таких препаратов, последствия коснулись
          практически всей группы торговых марок и всех стран, <b>включая СНГ</b>
          </p>          
          
<h2>⛔ Какие препараты попали «под раздачу»?</h2>
<h3>・ Meridia</h3>
          <p>
          Стала, пожалуй, самым известным примером того, как полноценное лекарство может пройти путь от
          официального рецептурного препарата до полного исчезновения с национального рынка
          </p>
          
<h3>・ Линдакса</h3>
          <p>
          Была одним из официальных препаратов с сибутрамином, доступных на европейском
          и СНГ рынках до общеевропейской приостановки продаж в 2010 году
          </p>
          
<h3>・ Zelixa</h3>
          <p>
          Все перечисленные выше препараты являлись фактически капсулами в желатиновой оболочке,
          а Zelixa была обычными прессованными таблетками, но с тем же составом
          </p>
          
<h3>・ Obesan</h3>
          <p>
          Был 16-ым и последним официально зарегистрированным препаратом, в составе которого
          есть сибутрамин, до запрета продажи подобных препаратов
          </p>
          
<h3>Sibutral, Ectiva, Reduxil и другие препараты</h3>
          <p>
          Они по сути являются просто торговыми марками для разных стран,
          но с одним составом, производителем и единой европейской лицензией на продажу
          </p>
          
<h3>Но вот незадача:</h3>
          <div class="info-box">
          <p>
          <b>Ни в одном из многочисленных списков и архивов</b> не было даже похожего названия на слово «Молекула»
          </p>
          </div>
        `
        },

        {
heading: "Как связаны Германия, сибутрамин и 2010ый год?",
content:`

<h2>🧪 Теперь перейдем к Молекуле</h2>

          <img src="./images/mlk-blue2.jpg"
          alt="upackovki" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
          
<h2>– Есть ли все-таки там сибутрамин?</h2>
          <p>
          Никто не может утверждать, что в ней есть сибутрамин, ровно так же как и утверждать, что в ней его нет
          </p>
          <div class="info-box">
          <p>
          Данную информацию могут подтвердить исключительно лабораторные экспертизы, но есть нюанс:
          </p>
          <p>
          Так как Молекула официально <b>не имеет лицензии на открытые продажи</b>, ни одна лаборатория
          не возьмет ее на экспертизу, даже частная и в срочном порядке
          </p>
          </div>
          
<h2>Правда ли 🇩🇪?</h2>
          <p>
          Представим, что да и сопоставим с открытой информацией о БАДах, в которых содержится сибутрамин
          </p>
          
          <p>
          <b>И вот так дела:</b>
          <br>
          ✘ Старые инструкции к применению
          <br>
          ✘ Архивы аптек
          <br>
          ✘ Фотографии упаковок как минимум до 2010 года
          <br>
          ✘ Обсуждения на немецких форумах
          <br>
          ✘ Публикации о снятии Молекулы с европейского рынка
          <br>
          ✘ Врачебные упоминания
          </p>
          
<h3>🩺 Но кое-что все же удалось найти:</h3>
          <div class="info-box">
          <p>
          в 2023 году ведомство Рейнланд-Пфальц(Германия) отправила на экспертизу неизвестный китайский препарат
          под названием «Молекула», которую местный житель <b>заказал с Amazon'а из Гонконга</b>,
          и в которой обнаружили сибутрамин и фенолфталеин
          </p>
          </div>
          
          <p>
          ⚛︎ Это является <b>самым первым</b> и <b>единственным</b> появлением торговой марки "Молекула" вообще
          во всем немецком интернете
          </p>
          
<h2>🤓 А доказательства?!</h2>     
<h3>❶ DPMA (Немецкое патентное и ведомство по товарным знакам)</h3>          
          <p>
          ❌ Нет никаких прямых свидетельств о существовании бренда «Molecule» в какие-либо годы
          <br>
          (ведомство предоставляет любую открытую информацию и реестр зарегистрированных
          товарных знаков на территории Германии <b>вплоть до конца XIX века</b>)
          </p>
          
<h3>❷ EUIPO (товарные знаки ЕС)</h3>
<h4>Были проверены:</h4>
          <p>
          - регистрация
          <br>
          - правообладатель
          <br>
          - история бренда
          <br>
          - документы
          </p>
          
          <div class="info-box">
          <p>
          ❌ И ничего не нашлось
          </p>
          </div>
          
<h3>❸ Реестр немецких аптек</h3>
          <p>
          <i>Редуксил, Орлистат, Ксеникал, Алмейзд</i>
          </p>
          
          <p>
          Все это есть; <b>все, кроме Молекулы...</b>
          </p>

          <p>
          ❌ Ни до 2010 года, ни после <b>ни одна аптека не продавала товара с таким
          названием</b> в виде таблеток для похудения
          <br>
          И более того, препаратов с другим действием с таким названием тоже <b>нет вовсе</b>
          </p>
          
          <div class="info-box">
          <p>
          Все это есть в абсолютно открытом доступе и мы специально не стали переводить аббревиатуры
          организаций, чтобы у тебя была возможность найти всю необходимую информацию и 
          доказательства
          </p>
          </div>
        `
        },
   
        {
heading: "Как связаны Германия, сибутрамин и 2010ый год?",
content:`

<h2>🧬 Зачем мы все это раскрываем?</h2>
          <p2>
          ⋆ Затем, чтобы наши покупатели знали, что <b>не все, что попадает в интернет – чистая правда</b> 
          </p2>
          
          <br>
          
          <p2>
          ⋆ Затем, чтобы не попадаться на скам-схемы, когда «ту самую, настоящую Молекулу из
          Германии» <b>продают в 3-5 раз дороже ее средней рыночной цены</b>
          </p2>
          
          <br>
          
          <p2>
          И самое главное:
          <br>
          ⋆ Затем, чтобы быть перед нашими покупателями честными
          </p2>
          
          <img src="./images/arttmolecule3.jpg"
          alt="logomolecule" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">        
          
          <div class="info-box">          
          <b>Ведь на каждого врунишку-маркетолога найдется свой любопытный и умеющий пользоваться
          интернетом покупатель</b>
          </div>           
        `
        }
        ] 
        },

/*--------------------------
           Plus
--------------------------*/
      
  "supplements-plus": {
   
section: "supplements",
title: "Сложности выбора и как его сделать",
category: "библиотека БАДов", 
pages:  [
        {
heading: "Molecule Plus",
content:`

          <img src="./images/mlk-blue3.jpg"
          alt="plus1" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
          
<h2>Что из себя представляет</h2>
          <p>
          Базовая база, 40 капсул
          </p>
          
<h2>Курс на 1 упаковку</h2>
          <p>
          27 дней
          </p>
         
<h2>Количество упаковок на 30дневный курс</h2>
          <p>
          2 упаковки (всего потребуется 45 капсул)
          </p>
          
<h2>Стоимость</h2>
          <p>
          ± 850₽ в нашем тгк
          </p>
         
<h2>Подходит если</h2>
          <p>
          Ты хочешь избавиться от лишних килограммов за достаточно быстрое время
          </p>
          <p>
          Плюс также способствует нормализации работы желудка, но имеет <b>довольно выраженные</b> побочки
          </p>
          
<h2>Состав</h2>
           <ul>
            <li>Семена фенхеля</li>
            <li>Гарциния камбоджийская</li>
            <li>Семена черного тмина</li>
            <li>Черный чай</li>
            <li>Спирея</li>
            <li>Плоды кактуса</li>
            <li>Экстракт зеленого кофе</li>
            <li>Корень одуванчика</li>
            <li>Листья ясеня</li>
            <li>Цветы гибискуса</li>             
           </ul>  

          <img src="./images/mlk-blue1.jpg"
          alt="blue" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 

<h2>Если твой ИМТ</h2>
           <ul>
            <li><b>Ниже</b> нормы: 3-6 кг</li>
            <li><b>В пределах</b> нормы: 5-10 кг</li>
            <li><b>Выше</b> нормы: 8-16 кг</li>
           </ul> 
       
<h2>Правила приема</h2>
           <ul>
            <li><b>Первые 15 дней</b>: 1 капсула за 40 минут до первого приема пищи</li>
            <li><b>Начиная с 16го дня</b>: добавить прием 2ой капсулы за 40 минут до приема пищи, не позднее, чем за 7-8 часов о сна</li>
           </ul> 

<h2>Перерывы после курса Molecule Plus</h2>
           <ul>
            <li>plus → plus — <b>30 дней</b></li>
            <li>plus → жб — <b>31 день</b></li> 
            <li>plus → ultra — <b>21 день</b></li>
            <li>plus → premium — <b>14 дней</b></li>
            <li>plus → supressa — <b>14 дней</b></li>
            <li>plus → mineral — <b>5-7 дней</b></li>
            <li>plus → heedly slimcomplex — <b>5-7 дней</b></li>         
            <li>plus → ozempic — <b>7 дней</b></li>
            <li>plus → neo — <b>14 дней</b></li>      
            <li>plus → pro — <b>14 дней</b></li> 
           </ul>   
        `
        },

        {
heading: "Как выглядит оригинал?",
content:`
          <div class="info-box">          
          Во всех партиях единый внешний вид пакетика и самих капсул
          </div>
          
<h2>🔖 Пакетик:</h2>           
          <p>
          ♡ белый, глянцевый с серебряными надписями «molecule plus» по диагонали
          </p>

          <img src="./images/plusupack.jpg"
          alt="pack" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
          
<h2>💊 Капсула:</h2>
          <p>
          ♡ белая, без надписей
          </p>
          <img src="./images/mlk-tabletki.jpg"
          alt="kapsulki" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
          
          <p>
          ♡ внутри желто-коричневый порошок, пахнущий травами
          </p>
          <img src="./images/plussostav.jpg"
          alt="sostav" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">           
                                                   
<h2>Даты сроков годности и описание коробок оригинальных упаковок</h2>

<h3>Вариант с радужными деталями и кьюар-кодом</h3>

          <img src="./images/plus-golofraphy.jpg"
          alt="orig plusrainbow" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 

          <div class="info-box">
          <p>
          <b>В некоторых партиях возможен брак в виде надписей «Molecule Premium» внутри коробки</b>
          </p>
          </div>
          
<h3>February 2025 - June 2028</h3>
          <p>
          ✧ кьюар-код: <b>зеленый</b>
          <br>
          ✧ упаковка: <b>радужная</b>
          </p>

<h3>February 2026 - June 2029</h3>
          <p>
          ✧ кьюар-код: <b>зеленый</b>
          <br>
          ✧ упаковка: <b>радужная</b>
          </p>

<h3>April 2026 - April 2029</h3>
          <p>
          ✧ кьюар-код: <b>черный</b>
          <br>
          ✧ упаковка: <b>радужная</b>
          </p>


<h3>May 2026 - September 2029</h3>
          <p>
          ✧ кьюар-код: <b>зеленый</b>
          <br>
          ✧ упаковка: <b>радужная</b>
          </p>

<h3>June 2026 - October 2029</h3>
          <p>
          ✧ кьюар-код: <b>зеленый</b>
          <br>
          ✧ упаковка: <b>радужная</b>
          </p>
          
<h3>Вариант с серебряными деталями и без кьюар-кода</h3>

          <img src="./images/plus-silver.jpg"
          alt="origplussilver" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
          
<h3>February 2025 - June 2028</h3>
          <p>
          ✧ кьюар-код: <b>отсутствует</b>
          <br>
          ✧ упаковка: <b>серебряная</b>
          </p>
          
<h3>February 2026 - June 2029</h3>
          <p>
          ✧ кьюар-код: <b>отсутствует</b>
          <br>
          ✧ упаковка: <b>серебряная</b>
          </p>

<h2>Сравнение двух разных партий</h2>

          <img src="./images/sravnenije.jpg"
          alt="kapsulki" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">  
          
          <p>
          ♡ <b>Обе капсулы являются оригинальными</b>, но цвет может варьироваться от партии к партии, в зависимости от
          разной концентрации и дозировки действующих веществ
          </p>
        `
        }
        ]
        },

/*--------------------------
          Premium
--------------------------*/
      
  "supplements-prem": {
   
section: "supplements",
title: "Cложности выбора и как его сделать",
category: "библиотека БАДов", 
pages:  [      
        {
heading: "Molecule Premium",
content:`

          <img src="./images/premupack2.jpg"
          alt="pack" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h2>Что из себя представляет</h2>
          <p>
          Младший бро Плюса, 46 капсул
          </p>
          
<h2>Курс на 1 упаковку</h2>
          <p>
          23 дня
          </p>
          
<h2>Количество упаковок на 30дневный курс</h2>
          <p>
          2 упаковки (всего потребуется 60 капсул)
          </p>
          
<h2>Стоимость</h2>
          <p>
          ± 800₽ в нашем тгк
          </p>
         
<h2>Подходит если</h2>
          <p>
          У тебя желание побороть переедания
          </p>
          <p>
          Премиум способствует нормализации работы желудка, налаживая пищевое поведение и обладает <b>более деликатными</b>
          побочками
          </p>

<h2>Состав</h2>
          <ul>
            <li>Семена фенхеля</li>
            <li>Гарциния камбоджийская</li>
            <li>Семена черного тмина</li>
            <li>Черный чай</li>
            <li>Спирея</li>
            <li>Плоды кактуса</li>
            <li>Экстракт зеленого кофе</li>
            <li>Корень одуванчика</li>
            <li>Листья ясеня</li>
            <li>Цветы гибискуса</li>             
          </ul>  

          <img src="./images/premupack.jpg"
          alt="pack" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 


<h2>Если твой ИМТ</h2>
          <ul>
            <li><b>Ниже</b> нормы: 2-3 кг</li>
            <li><b>В пределах</b> нормы: 3-5 кг</li>
            <li><b>Выше</b> нормы: 7-10 кг</li>
          </ul>

<h2>Правила приема</h2>
          <ul>
            <li><b>На протяжении всего курса</b>: 2 капсулы в день, дробя прием на 2 раза</li>
            <li><b>1ая капсула</b>: за 40 минут до первого приема пищи</li>
            <li><b>2ая капсула</b>: за 40 минут до приема пищи, не позднее, чем за 7-8 часов о сна</li>
          </ul>            

<h2>Перерывы после курса Molecule Premium</h2>
          <ul>
            <li>premium → premium — <b>30 дней</b></li>
            <li>premium → жб — <b>31 день</b></li>
            <li>premium → ultra — <b>14 дней</b></li> 
            <li>premium → plus — <b>14 дней</b></li>
            <li>premium → supressa — <b>14 дней</b></li> 
            <li>premium → mineral — <b>5-7 дней</b></li>
            <li>premium → heedly slimcomplex — <b>5-7 дней</b></li>  
            <li>premium → ozempic — <b>7 дней</b></li>
            <li>premium → neo — <b>14 дней</b></li>             
            <li>premium → pro — <b>14 дней</b></li> 
          </ul>    
        `
        },

        {
heading: "Как выглядит оригинал?",
content:`
          <div class="info-box">          
          Капсулы и пакетик выполнены в едином стиле во всех партиях
          </div>
          
<h2>🔖 Пакетик:</h2>           
          <p>
          ♡ темно-синий, ближе к черному
          <br>
          ♡ матовый, с белыми надписями «molecule plus premium» по диагонали         
          </p>
          
          <img src="./images/premupack3.jpg"
          alt="kapsulki" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">          
          
<h2>💊 Капсула:</h2>
          <p>
          ♡ бело-голубая, чаще всего с надписью «Molecule» на синей части, но встречаются
          варианты без гравировки
          <br>
          ♡ внутри желто-коричневый порошок, пахнущий травами
          </p>
          
          <img src="./images/premsostav.jpg"
          alt="sostav" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">           
          
<h2>Даты сроков годности и описание коробок оригинальных упаковок</h2>

          <img src="./images/prem-orig.jpg"
          alt="orig prem" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
          
<h3>January 2025 - December 2028</h3>
          <p>
          ✧ кьюар-код: <b>черный</b>
          <br>
          ✧ упаковка: <b>радужная</b>
          </p>
 
<h3>October 2025 - September 2029</h3>
          <p>
          ✧ кьюар-код: <b>зеленый</b>
          <br>
          ✧ упаковка: <b>радужная</b>
          </p>

<h3>May 2026 - April 2030</h3>
          <p>
          ✧ кьюар-код: <b>черный</b>
          <br>
          ✧ упаковка: <b>радужная</b>
          </p>

<h3>June 2026 - May 2030</h3>
          <p>
          ✧ кьюар-код: <b>черный</b>
          <br>
          ✧ упаковка: <b>радужная</b>
          </p>
        `
        }
        ]
        },

/*--------------------------
           Ultra
--------------------------*/
      
  "supplements-ultra": {
   
section: "supplements",
title: "Сложности выбора и как его сделать",
category: "библиотека БАДов", 
pages:  [      
        {
heading: "Molecule Ultra",
content:`

          <img src="./images/ultraupack.jpg"
          alt="pack" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h2>Что из себя представляет</h2>
          <p>
          Считается сильнее Плюса и Премиума, 30 капсул
          </p>
          
<h2>Количество дней на курсе</h2>
          <p>
          30 дней
          </p>
          
<h2>Количество упаковок на курс</h2>
          <p>
          1 упаковка
          </p>
          
<h2>Стоимость</h2>
          <p>
          ± 1200₽
          </p>

<h2>Подходит если</h2>
          <p>
          У тебя имеется исключительно избыточный вес, индивидуальная переносимость компонентов
          </p>
          
          <p>
          Ультра способствует быстрому и эффективному похудению, но <b>подходит далеко не всем</b>
          <br>
          И сказать, подойдет ли она тебе, никто не сможет, так как это очень индивидуально
          </p>
          
          <p>
          Также, имеет <b>выраженные побочки</b> в виде головных болей и мигреней
          </p>

<h2>Состав</h2>
          <ul>
            <li>Семена фенхеля</li>
            <li>Гарциния камбоджийская</li>
            <li>Семена черного тмина</li>
            <li>Черный чай</li>
            <li>Спирея</li>
            <li>Плоды кактуса</li>
            <li>Экстракт зеленого кофе</li>
            <li>Корень одуванчика</li>
            <li>Листья ясеня</li>
            <li>Цветы гибискуса</li>             
          </ul>    

          <img src="./images/ultra.jpg"
          alt="ultra" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 

<h2>Если твой ИМТ</h2>
          <ul>
            <li><b>Ниже</b> нормы: 2-3 кг</li>
            <li><b>В пределах</b> нормы: 8-10 кг</li>
            <li><b>Выше</b> нормы: 13-20 кг</li>
          </ul>

<h2>Правила приема</h2>
          <ul>
            <li><b>На протяжении всего курса</b>: по 1 капсуле за 40 минут до первого приема пищи</li>
          </ul>    

<h2>Перерывы после курса Molecule Ultra</h2>
          <ul>
            <li>ultra → ultra — <b>60 дней</b></li>
            <li>ultra → жб — <b>31 день</b></li>
            <li>ultra → plus — <b>31 день</b></li>
            <li>ultra → premium — <b>21 день</b></li>
            <li>ultra → supressa — <b>14 дней</b></li>
            <li>ultra → mineral — <b>14 дней</b></li>
            <li>ultra → heedly slimcomplex — <b>5-7 дней</b></li>
            <li>ultra → ozempic — <b>7 дней</b></li>
            <li>ultra → neo — <b>14 дней</b></li>  
            <li>ultra → pro — <b>14 дней</b></li> 
          </ul>  

<h2>Пакетик и капсулы:</h2>
          <img src="./images/ultratabletki.JPG"
          alt="kapsulki" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">  
          
<h2>Что внутри:</h2>
          <img src="./images/ultrasostav.jpg"
          alt="sostav" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
        `
        }
        ]
        },

/*--------------------------
          zhb mlk
--------------------------*/
      
  "supplements-zb": {
   
section: "supplements",
title: "Сложности выбора и как его сделать",
category: "библиотека БАДов", 
pages:  [      
        {
heading: "Molecule Plus/Premium ЖБ",
content: `

          <img src="./images/zbupack.jpg"
          alt="pack" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h2>Что из себя представляет</h2>
          <p> 
          Считается одним из самых сильных БАДов на рынке жиросжигателей, 30 капсул
          </p>
          
<h2>Курс на одну упаковку</h2>
          <p> 
          20 дней
          </p>
          
<h2>Количество упаковок на 30дневный курс</h2>
          <p> 
          2 упаковки (всего потребуется 40 капсул)
          </p>
          
<h2>Стоимость</h2>
          <p> 
          ± 1500₽
          </p>

<h2>Подходит если:</h2>
          <p> 
          Тебя уже не берут своим действием все вышеперечисленные БАДы
          </p>
          
          <p>
          ЖБ способствует быстрому и эффективному похудению, но эффективность пока что <b>не доказана</b>, 
          помимо рекламных заявлений
          </p>

<h2>Состав</h2>
          <ul>
            <li>Семена фенхеля</li>
            <li>Гарциния камбоджийская</li>
            <li>Семена черного тмина</li>
            <li>Черный чай</li>
            <li>Спирея</li>
            <li>Плоды кактуса</li>
            <li>Экстракт зеленого кофе</li>
            <li>Корень одуванчика</li>
            <li>Листья ясеня</li>
            <li>Цветы гибискуса</li>             
          </ul>
          
          <p>          
          <b>Есть два варианта упаковки:</b>
          <ul>
            <li><b>2024-2029г</b> бело-голубые капсулы Premium</li>
            <li><b>2025-2030г</b> полностью белые капсулы Plus</li>
          </ul>
          Обе версии оригинальные и не отличаются составом
          </p>

          <img src="./images/mlkzhb.jpg"
          alt="mlkzhb" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 

<h2>Если твой ИМТ</h2>
          <ul>
            <li><b>Ниже</b> нормы: 5-8 кг</li>
            <li><b>В пределах</b> нормы: 11-15 кг</li>
            <li><b>Выше</b> нормы: 16-19 кг</li>
          </ul> 
          
<h2>Правила приема</h2>
          <ul>
            <li><b>Первые 10 дней</b>: 1 капсула за 30 мин до первого приема пищи</li>
            <li><b>С 10-го дня</b>: 1ая капсула за 30 мин до первого приема пищи; 2ая капсула за 30 мин до приема пищи, но не позднее, чем за 7-8 часов до сна</li>
          </ul> 
          
          <div class="info-box">
          <p>
          Если эффект от первой капсулы устраивает – <b>вторую пить необязательно</b>
          </p>
          </div>

<h2>Перерывы послее курса Molecule ЖБ</h2>
          <ul>
            <li>жб → жб — <b>30 дней</b></li>
            <li>жб → ultra/plus/premium — <b>31 день</b></li>
            <li>жб → supressa — <b>20 дней</b></li>
            <li>жб → mineral — <b>14 дней</b></li>
            <li>жб → heedly slimcomplex — <b>14 дней</b></li>   
            <li>жб → ozempic — <b>14 дней</b></li>
            <li>жб → neo — <b>30 дней</b></li>             
            <li>жб → pro — <b>30 дней</b></li> 
          </ul>     
        `
        }
        ]
        },

/*--------------------------
         Supressa
--------------------------*/
      
  "supplements-supressa": {
   
section: "supplements",
title: "Сложности выбора и как его сделать",
category: "библиотека БАДов", 
pages:  [      
        {
heading: "Supressa",
content:`

          <img src="./images/supressabanka.jpg"
          alt="pack" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h2>Что из себя представляет</h2>
          <p>
          Ныне запрещенный БАД, который считается по градации сильнее,
          чем Плюс и Прем, но слабее, чем ЖБ и Ультра, 36 капсул
          </p>
          
<h2>Курс на одну упаковку</h2>
          <p> 
          36 дней
          </p>
          
<h2>Количество упаковок на 30дневный курс<h2>
          <p> 
          1 упаковка
          </p>
          
<h2>Стоимость</h2>
          <p> 
          ± 900₽
          </p>

<h2>Подходит если</h2>
          <p> 
          Хочешь сменить БАД, но Ультра или ЖБ для тебя дорогие
          </p>
          
          <p>
          Способствует улучшению работы ЖКТ и налаживанию режима питания
          </p>

<h2>Состав</h2>
          <ul>
            <li>Индийское какао</li>
            <li>Яблочный уксус</li>
            <li>Кайенский перец</li>
            <li>Хром</li>
            <li>L-теанин</li>
            <li>Теобромин</li>
            <li>Экстракт зеленого кофе</li>
            <li>Экстракт зеленого чая</li>            
          </ul> 

<h2>Что внутри:</h2>
          <img src="./images/supressasostav.jpg"
          alt="sostav" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
          
<h2>Если твой ИМТ</h2>
          <ul>
            <li><b>Ниже</b> нормы: 3-5 кг</li>
            <li><b>В пределах</b> нормы: 5-7 кг</li>
            <li><b>Выше</b> нормы: 7-10 кг</li>
          </ul> 

<h2>Правила приема</h2>
          <ul>
            <li><b>1ая неделя</b>: по 1 капсуле <b>день через день</b> сразу после плотного приема пищи, независимо от времени суток</li>
            <li><b>Продолжение курса</b>: по 1 капсуле каждый день сразу после первого плотного приема пищи</li> 
          </ul>    

<h2>Перерывы после курса Supressa</h2>
          <ul>
            <li>supressa → supressa — <b>21 день</b></li>
            <li>supressa → жб — <b>14-20 дней</b></li>
            <li>supressa → ultra — <b>14 дней</b></li>
            <li>supressa → premium — <b>14 дней</b></li>
            <li>supressa → plus — <b>14 дней</b></li>
            <li>supressa → mineral — <b>7-10 дней</b></li>
            <li>supressa → heedly slimcomplex — <b>14 дней</b></li>  
            <li>supressa → ozempic — <b>7 дней</b></li>
            <li>supressa → neo — <b>14 дней</b></li> 
            <li>supressa → pro — <b>14 дней</b></li>   
          </ul>    
        `
        }
        ]
        },

/*--------------------------
          Mineral
--------------------------*/
      
  "supplements-mineral": {
   
section: "supplements",
title: "Сложности выбора и как его сделать",
category: "библиотека БАДов", 
pages:  [      
        {
heading: "Mineral Balance",
content: `

          <img src="./images/mineralupack.JPG"
          alt="pack" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h2>Что из себя представляет</h2>
          <p> 
          Довольно легкий БАД, при передозе которого побочки могут быть хуже,
          чем у Плюса, 30 капсул
          </p>
          
<h2>Курс на одну упаковку</h2>
          <p> 
          30 дней
          </p>
          
<h2>Количество упаковок на 30дневный курс</h2>
          <p> 
          1 упаковка
          </p>
          
<h2>Стоимость</h2>
          <p> 
          ± 500₽ в нашем тгк
          </p>

<h2>Подходит если</h2>
          <p> 
          Хочешь немного скорректировать питание и избавиться от отеков
          </p>
          <p>
          Способствует налаживанию режима питания
          </p>

<h2>Состав</h2>
          <ul>
            <li>Гуарана</li>
            <li>L-карнитин</li>
            <li>Перец чили</li>
            <li>L-аргинин</li>
            <li>Гарциния камбоджийская</li>
            <li>Худия</li>
            <li>Экстракт померанца</li>
          </ul> 

          <img src="./images/mineralbears.jpg"
          alt="минерал" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 

<h2>Если твой ИМТ</h2>
          <ul>
            <li><b>Ниже</b> нормы: 1-2 кг</li>
            <li><b>В пределах</b> нормы: 3-4 кг</li>
            <li><b>Выше</b> нормы: 5-6 кг</li>
          </ul> 

<h2>Правила приема</h2>
          <ul>
            <li><b>На протяжении всего курса</b>: по 1 капсуле за 30 минут до первого приема пищи</li> 
          </ul>   
          
          <div class="info-box">
          <p>
          Если эффект от одной капсулы не устраивает – через неделю приема можно добавить вторую по
          принципу приема Молекулы Плюс
          </p>
          </div>    

<h2>Перерывы после курса Mineral</h2>
          <ul>
            <li>mineral → mnieral — <b>14 дней</b></li>
            <li>mineral → жб — <b>14 дней</b></li>
            <li>mineral → ultra — <b>7 дней</b></li>
            <li>mineral → plus — <b>7 дней</b></li>
            <li>mineral → premium — <b>7 дней</b></li>
            <li>mineral → supressa — <b>14 дней</b></li>
            <li>mineral → ozempic — <b>7 дней</b></li>
            <li>mineral → heedly slimcomplex — <b>7 дней</b></li> 
            <li>mineral → neo — <b>14 дней</b></li> 
            <li>mineral → pro — <b>14 дней</b></li> 
          </ul>  

<h2>Пакетик и капсулы:</h2>

          <img src="./images/mineralupack2.jpg"
          alt="pack" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
          <img src="./images/mineraltabletki.jpg"
          alt="kapsulki" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h2>Что внутри:</h2>

          <img src="./images/mineralsostav.jpg"
          alt="sostav" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
        `
        }
        ]
        },

/*--------------------------
          Heedly
--------------------------*/
      
  "supplements-heedly": {
   
section: "supplements",
title: "Сложности выбора и как его сделать",
category: "библиотека БАДов", 
pages:  [      
        {
heading: "Heedly Slim-Complex",
content:`
          <img src="./images/heedlyupack.JPG"
          alt="pack" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h2>Что из себя представляет</h2>
          <p> 
          Один из самых деликатных БАДов, 60 капсул
          </p>
          
<h2>Курс на одну упаковку</h2>
          <p> 
          30 дней
          </p>
          
<h2>Количество упаковок на 30дневный курс</h2>
          <p> 
          1 упаковка
          </p>
          
<h2>Стоимость</h2>
          <p> 
          ± 700₽
          </p>

<h2>Подходит если</h2> 
          <p> 
          Ты уже похудел/а и хочется поддерживать свой вес; если не знаешь с
          чего начать похудение и хочется мягко переходить с курса на курс
          </p>
          
<h2>Состав</h2>
          <ul>
            <li>Спирулина</li>
            <li>Хром</li>
          </ul> 

          <img src="./images/heedly.jpg"
          alt="heedly" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
         
<h2>Если твой ИМТ</h2>
          <ul>
            <li><b>Ниже</b> нормы: поддерживает вес и не снижает его</li>
            <li><b>В пределах</b> нормы: 0,5-2 кг</li>
            <li><b>Выше</b> нормы: 1-3 кг</li>
          </ul> 

<h2>Правила приема</h2>
          <ul>
            <li><b>1ая капсула</b>: до или во время первого приема пищи</li> 
            <li><b>2ая капсула</b>: до или во время приема пищи, не позднее, чем за 7-8 часов до сна</li>         
          </ul>          

<h2>Перерывы после курса Heedly SlimComplex</h2>
          <ul>
            <li>heedly → heedly — <b>14 дней</b></li>
            <li>heedly → жб — <b>14 дней</b></li>
            <li>heedly → ultra — <b>7 дней</b></li>
            <li>heedly → plus — <b>7 дней</b></li>
            <li>heedly → premium — <b>7 дней</b></li>
            <li>heedly → supressa — <b>7 дней</b></li>
            <li>heedly → mineral — <b>7 дней</b></li>
            <li>heedly → ozempic — <b>7 дней</b></li> 
            <li>heedly → neo — <b>14 дней</b></li>
            <li>heedly → pro — <b>14 дней</b></li> 
          </ul>     
        `
        }
        ]
        },

/*--------------------------
          Reductil
--------------------------*/
      
  "supplements-reducsin": {
   
section: "supplements",
title: "Сложности выбора и как его сделать",
category: "библиотека БАДов", 
pages:  [      
        {
heading: "Редуксин",
content: `

          <img src="./images/reduksin.jpg"
          alt="reduksin" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h2>Что из себя представляет</h2>
          <p> 
          Единственный в СНГ рецептурный препарат в составе которого есть <b>сибутрамин</b>,
          30/90 капсул
          </p>
          
<h2>Курс на одну упаковку</h2>
          <p> 
          30 дней/90 дней
          </p>
          
<h2>Количество упаковок на 30дневный курс</h2>
          <p> 
          1 упаковка
          </p>
          
<h2>Стоимость</h2>
          <p> 
          В аптеках ± 4000₽
          <br>
          На маркетплейсах ± 900₽
          </p>

<h2>Подходит если</h2> 
          <p> 
          Ты имеешь избыточный вес или хочешь заменить Молекулу Ультра по действию
          </p>
          
<h2>Состав</h2>
          <ul>
            <li>15 мг сибутрамин</li>
            <li>153 мг целлюлоза микрокристаллическая(наполнитель)</li>
            <li>Кальция стеарат</li>
          </ul> 

          <div class="info-box">
          <b>❗️ Важно</b>: "Редуксин Лайт" в жестяной квадратной банке <b>не является аналогом или другой формой упаковки</b>
          <br>
          Это абсолютно другой БАД, в составе которого <b>нет сибутрамина</b>
          </div>   

<h2>Если твой ИМТ</h2>
          <ul>
            <li><b>Ниже</b> нормы: 4-7 кг</li>
            <li><b>В пределах</b> нормы: 8-10 кг</li>
            <li><b>Выше</b> нормы: 12-15 кг</li>
          </ul> 

<h2>Правила приема</h2>
          <ul>
            <li><b>На протяжении всего курса</b>: по 1 капсуле до или во время первого приема пищи</li>         
          </ul>   

<h2>Что внутри:</h2>

          <img src="./images/reducsostav.jpg"
          alt="sostav" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
        `
        }
        ]
        },

/*--------------------------
          Swap-x
--------------------------*/
      
  "supplements-swapx": {
   
section: "supplements",
title: "Сложности выбора и как его сделать",
category: "библиотека БАДов", 
pages:  [      
        {
heading: "Swapx Neo/Pro",
content: `

          <img src="./images/IMG_6219.JPG"
          alt="packsneopro" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
          <div class="info-box">
          Новинка среди БАДов для похудения, которая позиционруется как совокупность Молекулы с Супрессой
          </div>  
          
<h2>Swapx Neo</h2>

          <img src="./images/IMG_6220.JPG"
          alt="packsneopro" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h2>Что из себя представляет</h2> 
          <p>
          Более деликатная версия, 30 капсул
          </p>
          
<h2>Курс на одну упаковку</h2>
          <p>
          30 дней
          </p>
          
<h2>Количество упаковок на 30дневный курс</h2>
          <p>
          1 упаковка
          </p>
          
<h2>Стоимость</h2>
          <p>
          ± 1400₽
          </p>

<h2>Подходит если</h2> 
          <p>
          Ты имеешь избыточный вес или хочешь заменить Молекулу ЖБ по действию, но боишься постоянной усталости
          во время дефицита калорий на курсе
          </p>
          
<h2>Состав</h2>
          <ul>
            <li>Ниацин</li>
            <li>Хром пиколинат</li>
            <li>Берберин HCL</li>
            <li>Экстракт зеленого чая</li>
            <li>L-карнитин</li>
            <li>Гарциния камбоджийская</li>
            <li>Форсколин</li>
            <li>Гуарана</li>
          </ul> 

          <img src="./images/swapxneo.jpg"
          alt="swapxneo" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 

<h2>Если твой ИМТ</h2>
          <ul>
            <li><b>Ниже</b> нормы: 3-4 кг</li>
            <li><b>В пределах</b> нормы: 6-8 кг</li>
            <li><b>Выше</b> нормы: 9-16 кг</li>
          </ul> 

<h2>Правила приема</h2>
          <ul>
            <li><b>1ая неделя</b>: по 1 капсуле <b>день через день</b> сразу после приема пищи</li>
            <li><b>Продолжение курса</b>: по 1 капсуле каждый день сразу после первого приема пищи</li> 
          </ul>  

<h2>Перерывы после курса Swapx NEO</h2>
          <ul>
            <li>neo → neo — <b>20 дней</b></li>
            <li>neo → pro — <b>20 дней</b></li>
            <li>neo → жб — <b>30 дней</b></li>
            <li>neo → ultra — <b>14 дней</b></li>
            <li>neo → plus — <b>14 дней</b></li>
            <li>neo → premium — <b>14 дней</b></li>
            <li>neo → supressa — <b>14 дней</b></li>
            <li>neo → mineral — <b>7-10 дней</b></li>
            <li>neo → heedly slimcomplex — <b>10 дней</b></li>
            <li>neo → ozempic — <b>10 дней</b></li>
          </ul>

<h2>Как выглядят капсулы:</h2>

          <img src="./images/IMG_6223.jpg"
          alt="swapxprokaps" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">    

<h2>Что внутри:</h2>

          <img src="./images/IMG_6225.jpg"
          alt="swapxneokaps" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
        ` 
        },
   
        {
heading: "Swapx Pro",
content:`       

          <img src="./images/IMG_6221.JPG"
          alt="packpro" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h2>Что из себя представляет</h2>
          <p> 
          Усиленная вдвойне по компонентам версия, 30 капсул
          </p>
          
<h2>Курс на одну упаковку</h2>
          <p> 
          30 дней
          </p>
          
<h2>Количество упаковок на 30дневный курс</h2>
          <p> 
          1 упаковка
          </p>
          
<h2>Стоимость</h2>
          <p> 
          ± 1600₽
          </p>
        
<h2>Подходит если</h2>
          <p> 
          Ты имеешь выраженный избыточный вес
          </p>

<h2>Состав</h2>
          <ul>
            <li>Ниацин</li>
            <li>Хром пиколинат</li>
            <li>Берберин HCL</li>
            <li>Экстракт зеленого чая</li>
            <li>L-карнитин</li>
            <li>Гарциния камбоджийская</li>
            <li>Форсколин</li>
            <li>Гуарана</li>
          </ul>

          <img src="./images/swapxpro.jpg"
          alt="swapxpro" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 

<h2>Если твой ИМТ</h2>
          <ul>
            <li><b>Ниже</b> нормы: 5-6 кг</li>
            <li><b>В пределах</b> нормы: 8-12 кг</li>
            <li><b>Выше</b> нормы: 12-20 кг</li>
          </ul> 

<h2>Правила приема</h2>
          <ul>
            <li><b>1ая неделя</b>: по 1 капсуле <b>день через день</b> сразу после приема пищи</li>
            <li><b>Продолжение курса</b>: по 1 капсуле каждый день сразу после первого приема пищи</li> 
          </ul> 

<h2>Перерывы после курса Swapx PRO</h2>
          <ul>
            <li>pro → pro — <b>20 дней</b></li>
            <li>pro → neo — <b>20 дней</b></li>
            <li>pro → жб — <b>30 дней</b></li>
            <li>pro → ultra — <b>14 дней</b></li>
            <li>pro → plus — <b>14 дней</b></li>
            <li>pro → premium — <b>14 дней</b></li>
            <li>pro → supressa — <b>14 дней</b></li>
            <li>pro → mineral — <b>7-10 дней</b></li>
            <li>pro → heedly slimcomplex — <b>10 дней</b></li>
            <li>pro → ozempic — <b>10 дней</b></li>
          </ul>  
          
<h2>Как выглядят капсулы:</h2>

          <img src="./images/IMG_6222.jpg"
          alt="swapxprokaps" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">        

<h2>Что внутри:</h2>

          <img src="./images/IMG_6226.jpg"
          alt="swapxprokaps" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
       `
       }
       ]
       },

/*--------------------------
         Ozempic
--------------------------*/
      
  "supplements-ozempic": {
   
section: "supplements",
title: "Сложности выбора и как его сделать",
category: "библиотека БАДов", 
pages:  [      
        {
heading: "Turbo-Ozempic",
content:`

          <div class="info-box">
          Завершает наш список БАДов именно он, так как: казалось бы, самый популярный БАД для
          похудения среди взрослой аудитории наших покупателей, но о нем мало говорят
          </div>  
          
          <img src="./images/ozempic.jpg"
          alt="ozepmic" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h2>Что из себя представляет</h2>
          <p> 
          Идентичен по действию Минералу, 60 капсул
          </p>
          
<h2>Курс на одну упаковку</h2>
          <p> 
          30 дней
           </p>
         
<h2>Количество упаковок на 30дневный курс</h2>
          <p> 
          1 упаковка
           </p>
         
<h2>Стоимость</h2>
          <p> 
          ± 650₽
          </p>

<h2>Подходит если</h2>
          <p> 
          Ты хочешь разогнать метаболизм, убрать отеки и контролировать аппетит
          </p>
         
<h2>Состав</h2>
          <ul>
            <li>L-карнитин</li>
            <li>І-аргинин</li>
            <li>Экстракт гарцинии камбоджийской</li>
            <li>Синефрин</li>
            <li>Альфа-липоевая кислота</li>
          </ul>  

<h2>Если твой ИМТ</h2>
          <ul>
            <li><b>Ниже</b> нормы: 1-3 кг</li>
            <li><b>В пределах</b> нормы: 5-7 кг</li>
            <li><b>Выше</b> нормы: 8-10 кг</li>
          </ul> 

<h2>Правила приема</h2>
          <ul>
            <li><b>На протяжении всего курса</b>: по 1 капсуле 2 раза в день во время или после приема пищи</li>         
          </ul>  

<h2>Перерывы после курса Ozempic Pro/Turbo</h2>
          <ul>
            <li>ozempic → ozempic — <b>14 дней</b></li>
            <li>ozempic → жб — <b>14 дней</b></li>
            <li>ozempic → ultra — <b>10-14 дней</b></li>
            <li>ozempic → plus — <b>7 дней</b></li>
            <li>ozempic → premium — <b>7 дней</b></li>
            <li>ozempic → supressa — <b>14 дней</b></li>
            <li>ozempic → mineral — <b>7-10 дней</b></li>
            <li>ozempic → heedly slimcomplex — <b>14 дней</b></li> 
            <li>ozempic → neo — <b>14 дней</b></li> 
            <li>ozempic → pro — <b>14 дней</b></li> 
          </ul>     
        `
        }      
        ]
        },

/* =========================
      медицинские темы
========================== */      
/*--------------------------
       анализы и БАДы
 --------------------------*/
      
      "medical-tests": {

section: "medical",
title: "Общие анализы, медкомиссия и тесты на вещ-ва",
category: "видно ли БАДы для похудения в анализах",
pages:  [
        {
heading: "ОАК или общий анализ крови",
content:`
          
          <div class="info-box">
          Если говорить коротко:
          <br>
          обычные лабораторные анализы крови не покажут ни Молекулу, ни Супрессу, ни даже Редуксин
          </div>
                  
<h2>Что входит в состав ОАК, в том числе с СОЭ и лейкоцитарной формулой</h2>
          <ul>
            <li>Гемоглобин</li>
            <li>Эритроциты</li>
            <li>Лейкоциты</li>
            <li>Тромбоциты</li>
            <li>Воспалительные изменения в организме</li>
            <li>Скорость оседания эритроцитов(СОЭ)</li>
          </ul>
          
          <div class="info-box">
          <p>
          То есть, общий анализ крови НЕ определяет наличие лекарственных веществ в организме
          <br>
          <b>Совсем!</b>
          </p>
          </div>

          <img src="./images/himiya.jpg"
          alt="chemistry"
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
        `
        },

        {
heading: "ОАМ или общий анализ мочи",
content:`

<h2>Что входит в состав ОАМ</h2>
          <ul>
            <li>Белок</li>
            <li>Глюкоза</li>
            <li>Кетоны</li>
            <li>Лейкоциты</li>
            <li>Плотность</li>
            <li>pH</li>
            <li>Кровь</li>
          </ul>
          
          <div class="info-box">
          <p>
          Получается, общий анализ мочи тоже не покажет никаких результатов?
          <br>
          <b>Все верно!</b>
          </p>
          </div>
          
          <img src="./images/blood.JPG"
          alt="blood"
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
        `
        },

        {
heading: "А покажут ли что-то анализы для медкомиссии или тесты на наркотики?",
content:`

          <p>
          Хоть это все и звучит довольно убедительно, но теория о том, что Молекула или другие,
          подобные ей, пищевые добавки "вылезут" на медкомиссии перед учебой/работой или,
          не дай бог, в тесте на наркотики, не более, чем просто <b>МИФ</b>
          </p>

          <img src="./images/testnarkotiki.jpg"
          alt="test"
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
        `
        },
       
        {
heading: "На что действительно могут повлиять БАДы",
content:`

          <p>
          • Стимуляторы и БАДы для похудения могут лишь косвенно влиять на результаты ваших анализов, в том числе и общих
          <br>
          Это означает, что ферменты крови/мочи <b>могут меняться под влиянием приема, условно Молекулы</b>
          </p>
          <p>
          • НО! ни лабораторные работники, ни врач, ни кто-либо другой <b>не смогут определить точную причину изменений в вашем организме</b>
          </p>

<h2>На что могут влиять БАДы в анализах</h2>
          <ul>
            <li>Изменения электролитов (за счет обезвоживания организма, приема слабительных)</li>
            <li>Повышение креатинина (сильное обезвоживание)</li>
            <li>Повышение относительной плотности мочи (стресс при потере веса и обезвоживание)</li>
            <li>Повышение кетонов в моче (также обезвоживание)</li>
            <li>Повышение гемоглобина и гематокрита (повышенная потливость, снижение аппетита)</li>
            <li>Повышение эритроцитов (недостаток жидкости в организме)</li>
            <li>Понижение лимфоцитов (стресс организма от быстрой потери веса)</li>
          </ul>
          
          <img src="./images/analizy.jpg"
          alt="analizy"
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 

          <div class="info-box">
          <p>
          Все эти признаки чаще всего обуславливают воспалительным процессом в организме(ОРВИ и пр), 
          обычным недостаточным потреблением воды, интенсивными тренировками, рвотой/диареей накануне 
          или же обычными особенностями обмена веществ
          </p>
          </div>   
        `
        }
        ]
        },

/*--------------------------
    расстройтва и БАДы
--------------------------*/
      
  "medical-disorders": {

section: "medical",
title: "БАДы и расстройства психики",
category: "я дединсайд, мне 10 лет",
pages:  [
        {
heading: "ТДР/ГТР",
content:`

<h2>Тревожно-депрессивное/генерализованное тревожное расстройство</h2>
          <p>
          ✧ Тревожное расстройство одна из самых распространенных проблем
          <br>
          ✧ Молекула является стимулятором симпатической нервной системы, которая отвечает за реакцию «бей или беги»
          </p>

<h3>Побочные эффекты:</h3>
          <ul>
            <li>Усиление тревоги</li>
            <li>Внутреннее напряжение</li>
            <li>Ощущение, что невозможно расслабиться</li>
            <li>Учащенное сердцебиение</li>
            <li>Панические атаки</li>
            <li>Бессонница</li>
          </ul>

          <div class="info-box">
          ⋆ Если перевести на простой язык: тревога была 4/10, а становится 8/10
          </div>   

          <img src="./images/ano.jpg"
          alt="ano"
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
        `
        },

        {
heading: "СДВГ",
content:`

<h2>Синдром дефицита внимания и гиперактивности</h2>       
          <p>
          • В большинстве случаев при сочетании Молекулы и синдрома дефицита внимания и гиперактивности
          <br>
          Ты можешь замечать подъем сил и энергии
          <br>
          • Но дело в том, что это достаточно сильное заблуждение, так как организм попросту
          перевозбуждается и за этим следует очевидный упадок сил 
          </p>

<h3>Побочные эффекты:</h3>
          <ul>
            <li>Импульсивность</li>
            <li>Раздражительность</li>
            <li>Эмоциональная нестабильность</li>
            <li>Проблемы со сном</li>
          </ul> 

          <div class="info-box">
          ⋆ Простым языком: ты чувствуешь себя, наполненным силами и энергией на 110%,
          но спустя время устаешь и оцениваешь свои силы и энергию на -100%
          </div> 
          </p>

          <img src="./images/ano2.jpg"
          alt="ano2"
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
        `
        },

        {
heading: "ПРЛ",
content:`

<h2>Пограничное расстройство личности</h2>          
          <p>
          • Пограничное расстройство личности само по себе
          не является противопоказанием на курсе Молекулы 
          </p>

<h3>Побочные эффекты:</h3>
          <ul>
            <li>Раздражительность</li>
            <li>Вспышки гнева</li>
            <li>Эмоциональные качели</li>
            <li>Импульсивность</li>
          </ul> 

          <div class="info-box">
          ⋆ При ПРЛ эмоции и так довольно интенсивные и яркие, 
          Молекула же способна усиливать их до выраженных перепадов
          </div>

          <img src="./images/ano3.jpg"
          alt="ano3"
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
        `
        },

        {
heading: "Депрессия и ее эпизоды",
content:`

<h2>Депрессия/депрессивное расстройство</h2>          
          <p>
          • Этот случай зависит по большей части от тяжести эпизода
          </p>

<h3>Побочные эффекты:</h3>
          <ul>
            <li>Усиление тревоги</li>
            <li>Ухудшение депрессии</li>
            <li>Раздражительность</li>
            <li>Су✧ц✧дальные мысли</li>
          </ul> 

          <div class="info-box">
          ⚠️ Рекомендуем отказаться от приема БАДов, если у тебя наблюдались тяжелые депрессивные эпизоды, 
          так как прием курса может спровоцировать рецидив, который можеть перетечь в более тяжелое
          состояние
          </div>

          <img src="./images/ano4.jpg"
          alt="ano4"
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
        `
        },

        {
heading: "БРЛ",
content:`

<h2>Биполярное расстройство личности</h2>                    
          <p>
          • При биполярном расстройстве риск появления/усиления побочных эффектов
          значительно серьезнее всех вышеперечисленных диагнозов
          </p>

<h3>Побочные эффекты:</h3>
          <ul>
            <li>Гипомания (легкая форма мании)</li>
            <li>Мания (тяжелое псих. состояние, при котором теряется связь с реальностью)</li>
            <li>Сильное возбуждение</li>
            <li>Рискованное поведение</li>
            <li>Бессонница</li>
          </ul> 

          <div class="info-box">
          ❌ Крайне не рекомендуем начинать курс без консультации специалиста
          </div>

          <img src="./images/ano6.jpg"
          alt="ano6"
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
        `
        }       
        ]
        },

/*--------------------------
   витамины и лекарства
--------------------------*/
      
  "medical-vitamins": {

section: "medical",
title: "Витамины и лечебные препараты",
category: "на чем сидит твоя девушка?",
pages:  [
        {
heading: "white-list препаратов ✅",
content:`

<h2>✅ Седативные и снотворные</h2>
          <ul>
            <li>Магний (Глицинат, Бисглицинат, Таурат)</li>
            <li>Глицин (Глицин, Глицин Форте)</li>
            <li>Алимемазин (⚠️ Тералиджен <b><i>с осторожностью</i></b>)</li>
            <li>Доксиламин (Донормил)</li>
            <li>Мелатонин (Мелатонин Эвалар)</li>
          </ul> 

<h2>✅ НПВП (обезболивающие)</h2>
          <p><i>С осторожностью!⚠️</i></p>
          <ul>
            <li>Ибупрофен (Ибупрофен не больше 400 мг в сутки)</li>
            <li>Нимесулид (Нимесил, Найз)</li>
            <li>Парацетамол (Панадол, Парацетамол)</li>
            <li>Напроксен (Налгизин)</li>
          </ul> 
          
<h2>✅ Транквилизаторы и успокоительные</h2>
          <p><i>В умеренных дозах!⚠️</i></p>
          <ul>
            <li>Гидроксизин (Атаракс)</li>
            <li>Тофизопам (Грандаксин)</li>
            <li>Фабомотизол (Афобазол)</li>
            <li>препараты на основе Валерианы, Пустырника, Мелиссы</li>
            <li>Ативан (Феназепам, Диазепам, Лоразепам)</li>
          </ul> 

<h2>✅ Антигистаминные (противоаллергенные)</h2>
          <ul>
            <li>Цетиризин (Зиртек, Цетрин)</li>
            <li>Лоратадин (Кларитин)</li>
            <li>Дезлоратадин (Эриус, Дезал)</li>
            <li>Левоцетиризин (Супрастинекс)</li>
            <li>Фексофенадин (Аллегра)</li>
          </ul> 

          <img src="./images/pills2.JPG"
          alt="pills"
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">           
        `
        },

        {
heading: "black-list препаратов ❌",
content:`

<h2>❌ Седативные и снотворные</h2>
          <ul>
            <li>Тразодон (Триттико)</li>
            <li>Миртазапин</li>
            <li>Ниаламид</li>
            <li>Пиразидол</li>
            <li>Кветиапин</li>
          </ul> 

<h2>❌ НПВП(обезболивающие)</h2>  
          <ul>
            <li>Кеторолак (Кеторол, Кеторолак, Кетанов)</li>
            <li>Диклофенак (Диклофенак, Вольтарен, Ортофен, Дикловит)</li>
            <li>Мелоксикам (Мовалис, Амелотекс)</li>
            <li>Комби препараты (Цитрамон, Нурофен)</li>
          </ul> 
          
<h2>❌ Транквилизаторы и успокоительные</h2>    
          <ul>
            <li>Корвалол</li>
            <li>Валокордин</li>
            <li>Валосердин</li>
            <li>Амитриптилин</li>
            <li>Хлорпротиксен</li>
          </ul> 

<h2>❌ Антигистаминные(противоаллергенные)</h2>
          <ul>
            <li>Астемизол (Гисманал)</li>
            <li>Терфенадин (Трексил)</li>
            <li>Дифенгидрамин (Димедрол)</li>
            <li>Клемастин (Тавегил)</li>
            <li>Хлоропирамин (Супрастин)</li>
          </ul> 

<h2>❌‼️ СИОЗС и другие антидепрессанты ‼️</h2>
          
          <div class="info-box">
          <p>
          ⚠️ <b>Селективные Ингибиторы Обратного Захвата Серотонина и подобные им антидепрессанты НЕЛЬЗЯ
          совмещать с курсом БАДов для похудения</b>
          </p>
          </div>

          
<h2>❌ Прочие препараты, которые не следует пить</h2>
          <ul>
            <li>Макролидные антибиотики (Эритромицин, Кларитромицин)</li>
            <li>Препараты и БАДы на основе Зверобоя</li>
            <li>Местная анестезия, в т.ч стоматологическая (Лидокаин, Ультракаин)</li>
            <li>Мочегонные (Фуросемид, Торасемид)</li>
            <li>КОК (Джесс, Ярина, Жанин, Клайра)</li>
            <li>Противовирусные (Терафлю, Ибуклин, Ринза, Колдрекс, Фервекс, Антигриппин)</li>
            <li>Препараты от укачивания (Драмина, Коккулин)</li>
            <li>ИПП (Омез, Нексиум, Омепразол)</li>
            <li>Изотретиноин (Акнекутан, Роаккутан, Сотрет)</li>
          </ul> 

          <img src="./images/tabletki4.jpg"
          alt="tabletki"
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">           
        `
        },
       
        {
heading: "white-list витаминов ✅",
content:`
          
          <div class="info-box">
          <p>
          ❕<b>Предупреждение</b>: Витамины <b>не являются обязательными для приема на курсе</b>
          </p>

          <p>
          Если у тебя нет диагностированного дефицита хотя бы одного
          из витаминов, может образоваться риск развития авитаминоза
          </p>
          
          <p>
          ☆ <b>Принимать витамины – рекомендация, а не правило приема!</b>
          </p>
          </div>

<h2>✅ Магний + витамин B6</h2>
          <p>  
          • Вариантов Магния <b>очень много</b>, но не все они подходят для того,
          чтобы добиться нужного эффекта
          </p>
          <p>
          ✓ Лучше всего покупать:
          <ul>
            <li>Магния Глицинат</li>
            <li>ПМагния Хелат</li>
            <li>Магния Лактат</li>
          </ul>
          </p>
          
          <div class="info-box">
          <p>
          ⚠️ При приеме высоких доз магний может оказывать слабительное действие
          <br>
          А также, <b>Магния Цитрат, Оротат</b> – вызывают слабительное действие
          <br>
          <b>Магния Фосфат</b> – вызывает гиперстимуляцию сердечка
          </p>
          </div>

          <p> 
          🌀<b>Рекомендуемые дозы</b>: 300 мг в сутки, в вечернее время до/во время еды или перед сном
          <br>
          Магний усваивается лучше при единовременном приеме с <b>витамином B6</b>
          </p>
          
<h2>✅ Кальций + витамин D3</h2>
          <p>
          • Хоть мы и получаем ежедневно дозу кальция из нашей еды, БАДы для похудения вымывают
          незначительную часть минерала из организма
          </p>
          <p>
          🌀<b>Рекомендуемые дозы</b>: 400 мг в сутки, в дневное время, до/во время еды
          <br>
          Кальций лучше всего усваивается при единовременном приеме с витамином D3
          </p>

<h2>✅ Омега-3</h2>
          <p>
          • Самый безопасный и деликатный БАД для поддержания общего здоровья организма
          рекомендуется пить омега-3 как во время курса, так и во время перерывов
          </p>
          <p>
          🌀<b>Рекомендуемые дозы</b>: норма омега-3 для взрослых, включающая активные жирные кислоты ЭПК (EPA) и ДГК (DHA),
          может варьироваться в зависимости от целей и состояния здоровья,
          в утреннее/дневное время до/во время еды
          </p>

<h2>✅ Электролиты (ионизированные калий, магний, натрий)</h2>
          <p>
          • При приеме БАДов для похудения из организма вымываются важные электролиты,
          в следствии чего могут возникать побочные эффекты в виде слабости,
          потемнения в глазах, спазма мышц и тремора конечностей
          </p>
          <p>
          <b>☆ Рекомендуется</b> покупать минеральную воду или препарат Регидрон, в составе которых
          есть вышеперечисленные минералы
          </p>
          <p>
          🌀<b>Рекомендуемые дозы</b>: 1-2 стакана в день (не больше) независимо
          от времени суток и приема еды
          </p>

          <img src="./images/tabletki3.jpg"
          alt="tabletki"
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">           
        `
        },

        {
heading: "black-list витаминов ❌",
content:`

<h2>❌ СпортБАДы L-триптофан и 5-HTP</h2>
          <ul>  
            <li>Могут вызать скачок смертельно опасной перегрузки ЦНС,
            которая проявляется дикой тахикардией, галлюцинациями,
            судорогами и резким повышением температуры</li>
          </ul> 

<h2>❌ Сульфат железа</h2>
          <ul>  
            <li>Как и многие БАДы для похудения вызывает запор
            <br>
            Также, не рекомендуется пить «тяжелые» формы железа, так как в разы могут
            усугубиться проблемы с ЖКТ</li>
          </ul>    
     
          <img src="./images/pinkpills.jpg"
          alt="pills" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">     
        `
        }          
        ]
        },

/* =========================
       деликатные темы
========================== */
/*--------------------------
     месячные на курсе
--------------------------*/    
   
   "delicate-period": {

section: "delicate",
title: "Менструация на курсе",
category: "period",
pages:  [
        {
heading: "Нужен ли перерыв и почему",
content:`
          
          <div class="info-box">
          Напомним, что практически все БАДы для похудения имеют свойство <b>разжижать кровь</b>, что усиливает
          время кровотечения и, соответственно, ухудшает свертываемость крови
          </div>
          
          <img src="./images/period.JPG"
          alt="period" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
          <p>
          Как такового запрета принимать БАДы и прерывать курс во время критических дней нет
          <br>
          Но все же, имеются некоторые противопоказания
          </p>

<h2>При каких обстоятельствах стоит прервать курс?</h2>
<h3>Дисменорея</h3>
          <p> 
          Болезненные, обильные месячные, часто сопровождающиеся ухудшением общего состояния,
          повышением/понижением давления, обмороками
          </p>
          
<h3>Аменорея</h3>
          <p> 
          Полное отсутствие месячных в течение полумесяца и дольше
          </p>
<h3>Ухудшение общего состояния</h3>
          <p> 
          Если ты чувствуешь, что тебе сложнее даются обычные рутинные дела, чувствуешь
          слабость и недомогание
          </p>
<h3>Увеличение обилия</h3>
          <p> 
          Если ты заметила, что месячные стали <b>намного</b> обильнее, чем обычно
          </p>
          
<h2>На какой срок нужно прервать курс?</h2>
          <p> 
          Прекратить прием стоит на все время, которое идут критические дни
          </p>
          <p>
          Возобновлять курс как новый необходимости нет
          <br>
          Просто продолжай прием в обычном режиме, не считая дни месячных
          </p>
          <p>
          Например: ты остановилась на 20ом дне приема → месячные идут 3 дня → продолжи
          курс как 21ый день, а не 24ый
          </p>
        `
        },

        {
heading: "Какие фазы ты проходишь на курсе и почему во время кд привес",
content:` 

<h2>Фаза менструации</h2>
<h3>Физическая боль не самая главная проблема на этом этапе</h3>
          <p>
          В это время у тебя могут также:
          <br>
          ✧ Повышаться аппетит
          <br>
          ✧ Проявляться перепады настроения
          <br>
          ✧ Включаться режим энергосбережения организма
          <br>
          ✧ Задерживаться вода в теле
          </p>
          
          <div class="info-box">
          <p>
          Необходимо снизить дефицит калорий на курсе, чтобы твой организм мог иметь силы на обновление
          репродуктивной системы и восстановление после небольшой кровопотери
          </p>
          </div>   
          
          <img src="./images/periodcare.JPG"
          alt="period" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">  

<h2>Фаза фолликулогенеза</h2>
<h3>Или фолликулярная фаза</h3>
          <p>
          Это промежуток сразу после окончания менструальной фазы
          <br>
          В данную фазу у тебя могут:
          <br>
          ✧ Понижаться аппетит
          <br>
          ✧ Легче даваться повседневные задачи
          <br>
          ✧ Уменьшается сонливость
          <br>
          ✧ Все еще задерживаться вода
          </p>
          
          <div class="info-box">
          <p>
          В этот период можно начать постепенно повышать дефицит калорий и не пугаться
          пары набранных килограммов, так как это вода
          </p>
          </div>
          
<h2>Фаза овуляции</h2>
<h3>Фаза самого чистого и объективного веса</h3>
          <p>
          В овуляцию ты можешь наблюдать:
          <br>
          ✧ Максимальное снижение аппетита
          <br>
          ✧ Повышение настроения
          <br>
          ✧ Максимальный уровень энергии
          <br>
          ✧ Продуктивность
          <br>
          ✧ Снижение отечности
          </p>

          <div class="info-box">
          <p>
          Эта фаза отлично подойдет для того, чтобы заняться спортом и замерить
          свой контрольный вес
          </p>
          </div>
          
          <img src="./images/delicate.jpg"
          alt="delicate" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h2>Лютеиновая фаза</h2>
<h3>Или фаза спячки/запасения</h3>
          <p>
          В такую пору ты можешь ощущать:
          <br>
          ✧ Повышенный аппетит
          <br>
          ✧ Небольшую задержку воды
          <br>
          ✧ Выравнивание настроения
          <br>
          ✧ Небольшую усталость
          <br>
          ✧ Сонливость
          </p>

          <div class="info-box">
          <p>
          В эту фазу твой организм превращается в мишку перед зимней спячкой:
          <br>
          создает запасы инсулина, жиров, белка и в целом энергии перед
          новой фазой менструации, поэтому рекомендуется держать не слишком
          сильный дефицит калорий не усердствовать с физнагрузкой
          </p>
          </div>
      `
      }
      ]
      },

/*--------------------------
      запоры на курсе
--------------------------*/  
      
  "delicate-constipation": {

section: "delicate",
title: "delicate",
category: "запоры на курсе",
pages:  [   
        {
heading: "На курсе появился запор. Что делать?",
content:`

          <div class="info-box">
          Данный побочный эффект, к сожалению, входит в список самых наиболее частых проблем у тех,
          кто пьет БАДы для похудения
          </div>
          
          <img src="./images/poop.jpg"
          alt="poop" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">

<h2>Давайте разберемся:</h2>
          <p>
          ✧ БАДы, в составе которых есть кофеин/экстракт кофе, способствуют не только притуплению аппетита,
          но и выработке адреналина и кортизола – гормонов стресса, которые активируются при попадании
          кофеина в кровь, вызывая сильную жажду, потооделение и прочие побочные эффекты, что служит
          причиной довольно сильного обезвоживания организма
          </p>

          <p>
          ➙ Так как нашему организму необходима вода для нормальной работы перистальтической системы,
          а воды недостаточно, кишечник замедляет свою работу, что и служит самой частой причиной
          запоров и боли в животе ниже пупка
          </p>

<h2>Рекомендации если такая беда настигает во время курса</h2>
<h3>1. Пей больше воды</h3>
          <p>
          Вода — главный фактор и компонент, чтобы решить эту проблему
          <br>
          Уже на данном этапе многие избавляются от виновника нашей статьи
          </p>

<h3>2. Прими положение лежа на левом боку</h3>
          <p>
          Это ускорит работу кишечника
          </p>
          
<h3>3. Не употребляй только сухую клетчатку и белок</h3>
          <p>
          Если ты любишь позавтракать гречей, перекусить салатом без заправки и поужинать двумя яичными белками,
          то скорее всего ты – обладатель данной проблемы
          </p>
          <p>
          Необходимо добавлять в рацион жиры, которые способствуют мягкому расщеплению 
          и прохождению белков и клетчатки
          </p>

<h3>4. Семена чиа перед приемом пищи</h3>
          <p>
          Семена чиа обладают способностью выделять естественную слизь, которая способствует
          обволакиванию желудка и непосредственно кишечника, что улучшает работу всего ЖКТ
          </p>
          
          <p>
          <b>Алгоритм приготовления семян чиа:</b>
          <br>
          ・ Столовая ложка сухих семян чиа на стандартные стакан/кружку(250 мл) теплой воды или кефира
          <br>
          ・ Тщательно размешай и дай настояться 15-30 минут
          <br>
          Клетчатка семян впитает влагу и превратится в гель, который мягко очистит кишечник
          </p>
          
          <div class="info-box">     
          <p>
          <b>⚠️ Примечание:</b>
          <br>
          Убедительно рекомендуем <b>НЕ</b> запивать <b>СУХИЕ</b> семена чиа водой
          <br>
          Употребление в таком виде способствует усугублению запора и ухудшению работы желудка
          </p>
          </div>
        `
        },
        {
heading: "Какие продукты могут облегчить ситуацию",
content:`

<h3>🥦 Овощи:</h3>
          <p>
          • Свекла
          <br>
          • Цветная капуста
          <br>
          • Квашенная капуста
          <br>
          • Морковь
          <br>
          • Брокколи
          <br>
          • Сельдерей
          <br>
          • Стручковая фасоль
          </p>
          
<h3>🍐 Фрукты:</h3>
          <p>
          • Киви (желательно с кожурой, так как в ней больше клетчатки, чем в самом фрукте)
          <br>
          • Зеленые яблоки
          <br>
          • Груши
          <br>
          • Ананасы
          </p>

<h3>🍇 Другое:</h3>
          <p>
          • Чернослив
          <br>
          • Изюм
          <br>
          • Курага
          <br>
          • Различные орехи
          </p>

<h3>🥣 Для увеличения обьема сьеденного:</h3>
          <p>
          • Отруби
          <br>
          • Гречка
          <br>
          • Овсянка
          </p>

<h3>🥩 Мясо:</h3>
          <p>
          • Куриная грудка
          <br>
          • Индейка
          <br>
          • Кролик
          </p>

<h3>🍤 Рыба:</h3>
          <p>
          • Палтус
          <br>
          • Кета
          <br>
          • Окунь
          <br>
          • Треска
          <br>
          • Судак
          </p>

<h3>🥛 Кисломолочные продукты:</h3>
          <p>
          • Творог (но не обезжиренный!)
          <br>
          • Сметана (также не обезжиренная!)
          </p>

<h3>🧈 Масла:</h3>
          <p>
          • Оливковое
          <br>
          • Льняное
          <br>
          • Нерафинированное подсолнечное
          </p>

<h3>🧃 Напитки:</h3>
          <p>
          • Кефир
          <br>
          • Ряженка
          <br>
          • Айран
          </p>
        `
        },
   
        {
heading: "Безрецептурные и аптечные препараты, которые действительно помогают",
content:`

<h2>✔️ Фитолакс(«Эвалар»)</h2>
          <p>
          Таблетки, на основе натуральных комплексов для нормализации работы кишечника
          </p>

<h3>Дозировка:</h3>
          <p>
          2 таблетки вечером во время еды, тщательно разжевать
          </p>

<h3>Эффект:</h3>
          <p>
          Через 8-12 часов
          </p>

<h3>Цена:</h3>
          <p>
          ≈350-1000₽
          </p>

<h2>✔️ Гутталакс в каплях</h2>
          <p>
          Контактное средство местного действия
          </p>

<h3>Дозировка:</h3>
          <p>
          10-20 капель в 250 мл воды перед сном
          </p>

<h3>Эффект:</h3>
          <p>
          Через 6-12 часов
          </p>

<h3>Цена:</h3>
          <p>
          ≈300-800₽
          </p>

<h2>✔️ Гутталакс в свечах</h2>
          <p>
          Быстродействующее контактное средство, деликатно стимулирует рецепторы слизистой кишечника
          </p>

<h3>Дозировка:</h3>
          <p>
          1 свеча в сутки
          </p>

<h3>Эффект:</h3>
          <p>
          Через 20-45 минут
          </p>

<h3>Цена:</h3>
          <p>
          ≈250₽
          </p>
        `
        },
   
        {
heading: "Что не стоит вносить в свой рацион питания, имея такую проблему",
content:`

<h2>❌ Какие продукты не стоит вносить в свое регулярное питание</h2>
          <p>
          • Острое
          <br>
          • Копченое
          <br>
          • Жирная и жареная еда
          <br>
          • Консервы
          <br>
          • Маринады
          <br>
          • Выпечка
          <br>
          • Жирные мясо/рыба/птица
          </p>
          
          <div class="info-box">
          <p>
          Все блюда мы рекомендуем варить/тушить/запекать, но не жарить
          </p>
          </div>

<h2>❌ Какие препараты мы НЕ рекомендуем использовать для слабительного эффекта на курсе</h2>
<h2>Бисакодил</h2>
<h3>Почему в нашем блэк-листе стоит именно он?</h3>
          <p>
          ・ Потому что бисакодил действует очень «варварским» способом, что оправдывает его
          низкую цену в аптеке, но очень высокую цену в виде последствий
          </p>

<h3>Действие:</h3>
          <p>
          Раздражает слизистую толстого кишечника и вызывает сильное сокращение его мышц
          </p>

<h3>Эффект:</h3>
          <p>
          Через 6-12 часов
          </p>

<h3>Проблемы, которые данный препарат влечет за собой:</h3>
          <p>
          <b>• Развитие синдрома «Ленивой перистальтики»</b>
          <br>
          Простым языком привыкание, при котором кишечник перестанет работать самостоятельно
          без стимуляции данным препаратом
          </p>
          
          <p>
          <b>• Обезвоживание и высокая потеря электролитов</b>
          <br>
          Бисакодил гонит воду из всего организма в кишечник, стимулируя его, что влечет за 
          собой выброс электролитов и в последствии снижение пульса и возможный обморок
          </p>
          
          <p>
          <b>• Сильные боль и спазмы</b>
          <br>
          Это основной механизм действия Бисакодила и он является одним из самых агрессивных
          среди слабительных препаратов
          </p>

          <p>
          <b>• Риск повреждения слизистой кишечника</b>
          <br>
          Прием высоких доз способен вызвать раздражение кишечника и в дальнейшем развития язв
          </p>
          
          <div class="info-box">   
          <p>
          <b>⚠️ Важное примечание!</b>
          <br>
          При запоре, который длится больше 1-1,5 недель, при условии, что все рекомендации соблюдены,
          рекомендуется обратиться к специалисту, так как возможен риск развития непроходимости,
          требующей медицинского и хирургического вмешательств
          </p>
          </div>
        `
        }
        ]
        },
      
/* =========================
           РПП
========================== */
/*--------------------------
         база рпп
--------------------------*/ 

      "rpp-basics": {

section: "rpp",
title: "Теория, которую все знают",
category: "база рпп",
pages:  [
        {
heading: "⒈ Что это вообще такое, у кого бывает и кто такие дранкорексички",
content:`

<h2>Что такое РПП?</h2>          
          <p>
          <b><i>⟣Расстройство пищевого поведения⟢</i></b> — это не просто желание похудеть
          или периодическая тревога из-за внешности
          </p>

          <p>
          РПП связано <b>с устойчивым нарушением отношений человека
          с едой, собственным телом и поведением вокруг питания</b>
          </p>

          <p>
          Пищевое поведение это не просто мысли о том «что я сегодня буду есть»
          <br>
          А фраза «просто перестань думать о еде» своей полезностью
          на таком же уровне, как и фраза сломанной электронике: «просто не зависай и работай»
          </p>

          <img src="./images/ano8.JPG"
          alt="ano" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
          <p>            
          Когда человек просто недоволен весом, он садится на обычную диету, но РПП — это совсем другое
          </p>

          <p>
          Это когда внутри живет огромная, болезненная нелюбовь к себе
          и кажется, что если уменьшиться в размерах, то эта пустота исчезнет, а тебя, наконец, полюбят и оценят
          по достоинству
          </p>
          
          <div class="info-box">
          <b>Но все это лишь попытка исправить разбитую душу через изнурение тела</b>
          </div>

<h2>Признаки нарушенных отношений с едой</h2>
          <ul>
            <li>Жесткие ограничения питания</li>
            <li>Страх определенных продуктов</li>
            <li>Постоянная проверка тела и веса</li>
            <li>Компенсаторное поведение</li>
            <li>Чувство вины после еды</li>
            <li>Сильная зависимость самооценки от внешности</li>
          </ul>
        `
        },

        {
heading: "Основные разновидности рпп",
content:`
          
<h2>⟣Орторексия⟢</h2>
          <p>
          — одержимость «чистым» питанием
          </p>
          
          <p>
          Это не просто желание питаться правильно, это настоящая мания и страх съесть что-то «вредное»
          <br>
          Человек делит еду на «правильную» и «токсичную» и выбирает еду не по вкусу или чувству голода, а по составу
          <br>
          Нарушение собственных правил вызывает у него панику и жесткое самобичевание
          </p>
          
          <div class="info-box">
          <p>
          Если в гостях или ресторане нет еды с идеальным «чистым» составом, орторексик предпочтет остаться голодным
          </p>
          </div>

          <img src="./images/kosti.jpg"
          alt="Фото2"
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
            
<h2>⟣Дранкорексия⟢</h2>
          <p>
          — алкоголь вместо еды
          </p>

          <p>
          Это расстройство, при котором человек намеренно отказывается от еды, чтобы «сэкономить» калории для алкоголя
          </p>

          <p>
          Другой вариант дранкорексии — когда после вечеринки с алкоголем человек устраивает себе
          жесткие голодовки или изнурительные тренировки, чтобы «отработать» выпитое
          </p>
          
          <div class="info-box">
          <p>
          Вместо полноценного обеда или ужина дранкорексик выбирает выпивку, потому
          что боится поправиться от лишних калорий в спиртном
          </p>
          </div>
            
<h2>⟣Булимия⟢</h2>
          <p>
          — замкнутый круг «срыв-наказание»
          </p>

          <p>
          Это расстройство, которое проявляется приступами неконтролируемого переедания,
          после которых человек пытается экстренно «очистить» организм
          </p>
          
          <div class="info-box">
          <p>
          Булимик за один раз может съесть огромное количество еды (часто прячась от других),
          а потом, испытывая дикий стыд и вину, бежит вызывать рвоту, пьет слабительные или бежит
          на дорожку в спортзал, чтобы «стереть» этот срыв
          </p>
          </div>

<h2>⟣Преорексия⟢</h2>
          <p>
          — одержимость спортом в положении
          </p>

          <p>
          Расстройство, при котором беременные женщины изнуряют себя диетами и фитнесом, панически боясь набрать
          вес во время вынашивания ребенка
          </p>

<h2>⟣Бигорексия⟢</h2>
          <p>
          (мужская анорексия) — когда человеку кажется, что он слишком худой и «хилый», 
          даже если он уже выглядит как профессиональный бодибилдер
          <br> 
          Он живет в зале и одержим ростом мышц
          </p>
          
          <img src="./images/holodilnik.JPG"
          alt="holodilnik" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">          
        `
        },

        {
heading: "Рпп может выглядеть по-разному",
content:`

<h2>«Ты можешь выглядеть по-другому, но недовольство у нас одно на двоих»</h2>
          
          <div class="info-box">
          Отсутствие «типичного» внешнего вида не означает,
          что проблема недостаточно серьезна
          </div>

          <p>
          Внешность человека не позволяет надежно определить,
          есть ли у него расстройство
          </p>
          
          <p>
          Важнее смотреть на то, <b>насколько питание, мысли о теле и
          компенсаторные действия</b> начинают управлять жизнью человека
          </p>

          <p>
          Например, <b>люди с булимией</b> – чаще всего не истощенные и бледные призраки,
          а люди среднего или полного телосложения с зелено-серым цетом кожи, плохим запахом из рта
          из-за разрушающихся зубов и частого вызова рвоты с желудочным соком
          </p>

          <p>
          <b>Люди с анорексией</b> – не исчезающие романтизированные девушки из фильмов,
          а измученные своей болезнью люди с очаговыми залысинами на голове из-за недостатка витаминов,
          с вечно болезненными пролежнями на копчике из-за недостатка жировой массы и отсутствия сил двигаться
          </p>
          
          <img src="./images/cleanfood2.jpg"
          alt="cleanfood" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
          <div class="info-box">
          <p>
          Главное заблуждение о расстройствах пищевого поведения — думать, что человек с рпп 
          обязательно должен выглядеть как скелет, но это не так
          </p>
          </div>
          
          <p>          
          ☆ РПП — <b>это психическое расстройство</b> и оно происходит в голове, а не в теле, 
          а человек может иметь абсолютно обычный, средний вес или даже избыточный,
          но при этом внутри него каждый день идет жестокая война с едой, калориями и собственным телом
          </p>
            
          <img src="./images/tumblrpost.jpg"
          alt="tumblrpost"
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">  
        `
        }
        ]
        },

/*--------------------------
    привычки, чистая и 
       грязная еда
--------------------------*/ 

     "rpp-thoughts": {

section: "rpp",
title: "Привычки, «чистая» и «грязная» еда",
category: "дьявол в деталях",
pages:  [
        {
heading: "safe&fear food",
content:`
          
<h2>Что такое «безопасная» и «чистая» еда?</h2>
          <p>
          <b><i>safe-food</i></b> — продукты, которые вызывают минимальную тревогу и ощущаются как «разрешенные»,
          «контролируемые» или «безопасные»
          </p>

          <p>
          Иногда безопасным становится даже не сам продукт, а конкретная фирма, 
          конкретный вкус или даже конкретный способ приготовления
          </p>
          
          <img src="./images/cleanfood1.jpg"
          alt="cleanfood" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h2>Обычно у «чистых» продуктов есть свои признаки</h2>
          <ul>
            <li>🥣 Низкая калорийность</li>
            <li>🍌 Известная калорийность</li>
            <li>🥞 Маленький объем порции</li>
            <li>🍽 Высокий объем при низкой калорийности</li>
            <li>🍏 Высокая насыщаемость</li>
            <li>🍞 Репутация «полезного» продукта</li>
          </ul>
          
          <img src="./images/cleanfood3.jpg"
          alt="cleanfood"
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
          
<h2>А что такое «грязная» и «плохая» еда?</h2>
          <p>
          <b><i>fear-food</i></b> — это продукты, которые вызывают непропорционально сильную тревогу, 
          чувство опасности, вины или потери контроля
          <br>
          Очень часто в категорию «небезопасной» еды попадают те продукты, которые нам больше всего нравятся
          </p>
          
          <div class="info-box">
          <p>
          Например, любимый шоколад, паста, круассаны, любимое мороженое и тд, 
          что приводит к <b>постоянным навязчивым мыслям об этих продуктах</b>
          </p>
          </div>
          
          <img src="./images/dirtyfood.jpg"
          alt="fearfood" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h2>А как же проявляется привычка искать fear-food?</h2>
          <ul>
            <li>Заранее изучать меню ресторана, чтобы убедиться, что там есть «безопасная» еда</li>
            <li>Отказываться от встреч, связанных с едой</li>
            <li>Испытывать тревогу, если кто-то готовит для тебя</li>
            <li>Выбирать не то, что хочется, а то, что кажется менее опасным</li>
            <li>Делить еду на «заслуженную» и «незаслуженную»</li>
            <li>Мысленно рассчитывать, сколько придется пройти шагов после определенного блюда</li>
          </ul>
          
          <img src="./images/bulochka.jpg"
          alt="fearfood"
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">           
        `
        },

        {
heading: "На какие вопросы нужно ответить честно самому себе",
content:`

          <ul>
            <li>Есть ли продукты, которые я могу есть практически без чувства вины?</li>
            <li>Есть ли продукты, которые вызывают у меня тревогу еще до того как я их попробую?</li>
            <li>Есть ли ситуации, когда я выбираю еду не потому, что хочется, а потому что она кажется безопаснее?</li>
            <li>Есть ли ощущение, что некоторые продукты мне нужно «заслужить» тренировкой или ограничениями?</li>
          </ul>

          <div class="info-box">
          <p>
          <b>Фанфакт</b>: Со временем у тревожных и контролирующих людей список «чистых»
          продуктов становится все меньше и скуднее
          </p>
          </div>

          <img src="./images/hellokittyfood.jpg"
          alt="hkfood"
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;"> 
        `
        },

        {
heading: "Списки разрешенных и запрещенных рпп-продуктов",
content:`

<h2>Что есть «безопасно»</h2>
          <ul>
            <li>Огурцы, помидоры, листья салата</li>
            <li>Яйца, куриная грудка, обезжиренный творог</li>
            <li>Кабачки, брокколи, яблоки</li>
            <li>Ягоды, греческий йогурт, хлебцы, фитнес-батончики</li>
            <li>Продукты с маркировкой «фитнес», «лайт», «0%»</li>
          </ul>

          <img src="./images/food.jpg"
          alt="Фото16" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">

<h2>Какая еда будет ощущаться «грязной»</h2>
          <ul>
            <li>Хлеб</li>
            <li>Масло, сыр, орехи</li>
            <li>Кабачки, брокколи, яблоки</li>
            <li>Выпечка, арахисовая паста, пицца, мороженое</li>
            <li>Шоколад, фастфуд, макароны</li>
          </ul>
          
          <img src="./images/tortik.jpg"
          alt="tortik" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
        `
        }
        ]
        },

/*--------------------------
     теория о ремиссии
--------------------------*/ 
 
      "rpp-cycle": {

section: "rpp",
title: "Теория ремиссии",
category: "вечный круговорот",
pages:  [
        {
heading: "Существует ли ремиссия и можно ли вылечиться навсегда?",
content:`
          
          <div class="info-box">
          Сколько бы нутрициологов, диетологов и психологов не спорили между собой о том, можно ли полностью
          вылечиться от расстройства пищевого поведения, <b>каждые 52 минуты в мире умирает 1 человек от осложнений при рпп</b>
          </div>

          <p>
          Расстройства пищевого поведения имеют хроническую природу, схожую с химическими зависимостями, а
          полное «исцеление» маловероятно, однако достижима глубокая и длительная клиническая ремиссия
          </p>

          <p>
          При этом человек остается в группе риска: при возникновении мощного триггера нейронные связи,
          отвечающие за рпп-привычки, могут активироваться снова, <b>что приведет к рецидиву</b>
          </p>

          <img src="./images/zavtrak.jpg"
          alt="zavtrak" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
        
          <div class="info-box">
          <p>
          Мозг человека, прошедшего через рпп, <b>навсегда</b> запоминает жесткие диеты или очищение
          как «быстрый способ справиться со стрессом»
          </p>
          <p>
          В момент кризиса мозг автоматически пытается вернуться к старым, проверенным стратегиям выживания
          </p>
          </div>

<h2>«Но я же просто пытаюсь держать баланс и закрываю съеденное тренировками»</h2>
          <p>
          <b>Компенсация</b> или <b>компенсаторное поведение</b> – непреодолимое желание компенсировать
          съеденную еду спортом
          </p>
          
          <p>
          Например: после плотного обеда обязательно нужно пройти минимум 10 тысяч шагов
          </p>
          
          <p>
          Компенсация может давать кратковременное ощущение, 
          что ситуация находится под контролем
          </p>

          <div class="info-box">
          <p>
          После порыва компенсировать набранные калории их сжиганием за счет спорта, следует сталкивание
          организма и психики с последствиями жестких ограничений, а именно – с тревогой и нарастающими
          раздражением и ненавистью к себе
          </p>
          </div>        

          <img src="./images/screenarttmlk.jpg"
          alt="donteat" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
        `
        }
        ]
        },

/* =========================
       уход за собой
========================== */
/*--------------------------
           зубы
--------------------------*/
      
      "care-teeth": {

section: "care",
title: "Сохранить зубы, не принимая кальций",
category: "забота о себе",
pages:  [
        {
heading: "Реально ли сохранить зубы на курсе и обязательно ли нужен кальций",
content:`

          <img src="./images/dentist.jpg"
          alt="teeth" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h2>🦷 Стоит ли бояться того, что зубы шатаются?</h2>          
          <p>
          ⋆ Анатомия человеческих зубов изначально устроена так, что зубы сидят в лунке <b>неплотно</b>,
          держась только за корни и периодонт
          <br>
          и у каждого здорового человека, если приложить силу,
          будут шататься зубы
          </p>
          
          <p>
          ⋆ Если бы зубы были <b>НЕПОДВИЖНЫ</b>, то мы бы сломали их, пережевывая, например, яблоко
          </p>
          
          <div class="info-box"> 
          <p>
          ‼️ Если зубы шатаются от легкого толчка языком, то это уже <b>ПАТОЛОГИЯ</b> и в этом случае
          следует немедленно обратиться к врачу!!
          </p>
          </div>
          
<h2>🦷 Откуда берется боль?</h2>
          <p>
          ⋆ Боль в зубах чаще всего возникает из-за недостатка слюны во рту, что в следствии делает 
          эмаль тоньше, зубы слабже и появляется характерная боль и воспаление десен
          <br>
          ⋆ Также, причиной могут послужить непроизвольный бруксизм(скрежет зубами)
          <br>
          ⋆ Или спазмы челюсти
          </p>
          
<h2>🦷 Как можно облегчить боль?</h2>
          <p>
          ✓ Пить больше воды и следить за тем, чтобы во рту не было сухости
          <br>
          ✓ Следить за ежедневной гигиеной рта
          <br>
          ✓ Жевательная резинка без сахара(без/с ксилитом), <b>НО</b> не усердствуй,
          чтобы не перенапрячь жевательные мышцы
          <br>
          ✓ От боли в деснах можно использовать мазь Метрогил Дента или полоскать рот 
          раствором хлоргексидина с водой в пропорции 1:1
          <br>
          ✓ Используй нестероидные противовоспалительные обезболивающие на основе Ибупрофена, 
          <b>но не больше 400 МГ в сутки</b>
          <br>
          ✓ Обратиться к стоматологу для осмотра и составления анамнеза
          </p>

          <img src="./images/teethinside.JPG"
          alt="teeth" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h2>🦷 Нужен ли тебе кальций?</h2>
          <p>
          ✅ Кальций необходим для формирования и поддержания минерализованных тканей, включая зубы
          </p>

          <p>
          ❌ Но у здорового человека нет такой истории с зубами как:
          <br>
          <b>«Мало кальция → зубы сразу начали разрушаться»</b>
          </p>

          <p>
          ⋆ Эмаль уже сформировавшегося зуба <b>не получает кальций напрямую из крови так же,
          как костная ткань</b>
          </p>

          <p>
          ↪︎ <b>Поэтому</b> прием кальция в таблетках сам по себе <b>не способен укрепить уже поврежденную
          эмаль или защитить зубы от кариеса</b>
          </p>
          
<h2>🦷 При похудении и особенно при жестких ограничениях на состояние зубов могут влиять и другие факторы:</h2>
          <p>
          ⋆ Дефицит энергии и нутриентов
          <br>
          ⋆ Недостаток витамина D
          <br>
          ⋆ Изменение состава и количества слюны
          <br>
          ⋆ Сухость во рту
          </p>
          
          <div class="info-box">
          <p>
          При регулярной рвоте отдельной проблемой становится воздействие желудочной кислоты
          <br>
          Она может вызывать эрозию эмали, и здесь дополнительный кальций, к сожалению,
          не работает как магический щит
          </p>
          </div>

<h2>🦷 Поэтому для зубов важен не только кальций, но и:</h2>
          <p>
          ⋆ Нормальное питание в целом
          <br>
          ⋆ Достаточное поступление необходимых нутриентов
          <br>
          ⋆ Достаточное количество воды и здоровье полости рта
          </p>

          <p>
          ❕ Если ты худеешь, имеет смысл обращать внимание не только на количество калорий,
          но и на качество рациона
          </p>

          <p>
          ↪︎ Кальций важен, но принимать его автоматически всем подряд не нужно
          <br>
          ✅ Лучше сначала оценить, сколько кальция уже поступает с пищей, а при 
          подозрении на дефицит или наличии факторов риска обсудить это с врачом и при 
          необходимости подобрать обследование или добавку
          </p>
          
          <div class="info-box">
          <p>
          Достаточное поступление кальция, белка, витамина D и энергии помогает не
          превратить процесс похудения в медленную попытку организма выжить
          на остатках ресурсов
          </p>
          </div>
        `
        }
        ]
        },

/*--------------------------
           кожа
--------------------------*/      
      
      "care-skin": {

section: "care",
title: "Почему лицо – отражение ЖКТ",
category: "забота о себе",
pages:  [
        {
heading: "Как сохранить качество кожи и почему нельзя пить системные ретиноиды",
content:`

          <img src="./images/skincare1.JPG"
          alt="skin" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">

          <div class="info-box">
          БАДы для похудения сами по себе не считаются препаратами, которые вызывают такие реакции,
          <b>но такое бывает</b>
          </div>
          
<h3>❔ Давайте разберем несколько механизмов по порядку:</h3>

<h2>❶ Первый вариант: Обычная аллергия на лекарства</h2>
          <p>
          ✿ Иммунная система по какой-то причине начинает воспринимать БАДы или продукты их метаболизма
          как что-то чужеродное и опасное
          </p>
          
<h3>Тогда запускается каскад иммунных реакций:</h3>
          <p>
          ✿ Расширение сосудов
          <br>
          ✿ Выделение гистамина
          <br>
          ✿ Зуд
          <br>
          ✿ Появление красных пятен
          </p>

<h2>❷ Вариант второй: Активное выделение пота</h2>
<h3>БАДы для похудения часто вызывают:</h3>
          <p>
          ✿ Жар
          <br>
          ✿ Ощущение перегрева
          <br>
          ✿ Потливость
          <br>
          ✿ Раздражение волосяных фолликулов
          </p>
          
          <div class="info-box">
          <p>
          С первого взгляда кажется, что это аллергия на препарат, но на самом деле
          кожа просто постоянно находится во влажном и раздраженном состоянии
          </p>
          </div>

          <img src="./images/skincare2.JPG"
          alt="skin" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          

<h2>❸ Третий вариант: Влияние на уже существующую болезнь</h2>
<h3>Если у тебя есть склонность к:</h3>
          <p>
          ✿ Атопическому дерматиту
          <br>
          ✿ Экземе
          <br>
          ✿ Хронической крапивнице
          <br>
          ✿ Аллергиям
          </p>
          
          <p>
          <i>Стимуляция нервной системы БАДами для похудения может спровоцировать появление
          или усилить уже имеющиеся заболевания</i>
          </p>
          
<h2>❔ Что же делать, чтобы избежать этих проблем?</h2>
<h3>Если речь идет про потливость:</h3>
          <p>
          ✓ Пить больше воды
          <br>
          ✓ Чаще принимать прохладный душ
          <br>
          ✓ Не оставаться долго в мокрой одежке после прогулки или спорта
          </p>

<h3>Если есть склонность к аллергиям:</h3>
          <p>
          ✓ Не вводить одновременно кучу новых БАДов и препаратов
          <br>
          ✓ Следить, после чего именно появились симптомы
          </p>

          <div class="info-box">
          <p>
          ⚠️ Примечание:
          <br>
          При выявлении высыпаний, которые возникли из-за БАДов, рекомендуется прекратить их прием
          </p>
          </div>
        `  
        },
   
        {
heading: "Как сохранить качество кожи и почему нельзя пить системные ретиноиды",
content:`

<h2>🧴Наружные ретиноиды</h2>
          <p>
          ✅ Наружные ретиноиды обычно можно сочетать
          <br>
          ❌ А вот системные ретиноиды требуют гораздо большей осторожности
          </p>

<h2>К наружным ретиноидам относятся:</h2>
          <p>
          ✧ Третиноин
          <br>
          ✧ Адапален
          <br>
          ✧ Тазаротен
          </p>
          
          <div class="info-box">  
          <p>
          При нанесении на кожу их системное всасывание обычно очень небольшое, поэтому БАДы 
          не являются стандартным противопоказанием к наружному применению
          </p>
          </div>
          
<h3>Но есть другой момент:</h3>

          <div class="info-box">
          <p>
          ❕ Ретиноиды сами по себе часто вызывают сухость, раздражение, шелушение и
          повышенную чувствительность кожи
          </p>

          <p>
          ➙ При использовании средств, которые дополнительно обезвоживают организм 
          или кожу, субъективно качество кожи может стать хуже
          </p>
          </div>

<h2>💊 Системные ретиноиды</h2>
          <p>
          ‼️ А вот если речь идет об изотретиноине внутрь, ситуация совершенно другая
          </p>

          <p>
          ➙ Изотретиноин действует системно и требует контроля врача
          <br>
          ➙ У него есть собственные потенциально серьезные побочные эффекты и
          лекарственные взаимодействия
          <br>
          ➙ Например, изотретиноин нельзя сочетать с витамином А и 
          препаратами/добавками, содержащими витамин А, поскольку это
          повышает риск гипервитаминоза
          <br>
          ➙ Также, его не следует одновременно принимать с тетрациклинами, поскольку
          описано повышение риска внутричерепной гипертензии
          </p>

<h2>Почему нельзя?</h2>
<h3>Если ты принимаешь изотретиноин и параллельно комплекс БАДов, в которых возможно есть:</h3>
          <p>
          • Витамин А
          <br>
          • Ретинол
          <br>
          • Ретинилпальмитат
          <br>
          • Другие источники витамина А
          <br>
          • Вещества с потенциальными лекарственными взаимодействиями
          </p>
          
          <div class="info-box">
          <p>
          Они могут вступить в непредвиденное и неприятное взаимодействие,
          поэтому при системных ретиноидах состав каждой добавки имеет значение
          </p>
          </div>
          
          <div class="info-box">
          <p>
          ⚠️ Настоятельно не рекомендуется самостоятельно комбинировать несколько продуктов,
          каждый из которых содержит жирорастворимые витамины
          </p>
          </div>

          <p>
          ❕ Сами БАДы уже являются препаратом с существенными сердечно-сосудистыми рисками
          </p>

          <p>
          ↪︎ Поэтому проблема комбинации может заключаться не в том, что:    
          </p>
          
          <div class="info-box">
          Ретиноид + БАДы с кофеином = токсичная химическая реакция
          </div>
          
          <p>
          ↪︎ А в том, что человек одновременно использует несколько средств,
          каждое из которых обладает собственным профилем риска
          </p>

          <p>
          ‼️ И если к этому добавить кофеин, йохимбин, стимуляторы, деконгестанты или
          другие жиросжигатели, становится еще "веселее"
          </p>
          <br>
          <br>
          <p>
          <i>Но фармакологам в этот момент обычно уже не смешно</i>
          </p>
          
<h2>Что в итоге❓</h2>
<h3>Наружный ретиноид + БАДы для похудения</h3>
          <p>
          ✅ Обычно нет специфического взаимодействия
          </p>

<h3>Изотретиноин внутрь + БАДы для похудения</h3>
          <p>
          ⚠️ Такую комбинацию не стоит начинать самостоятельно
          <br>
          ⋆ Необходимо учитывать противопоказания обоих препаратов и все
          остальные лекарства/добавки
          </p>

<h3>Изотретиноин + БАДы с витамином А в составе</h3>
          <p>
          ❌ Вот здесь состав нужно проверять особенно тщательно
          <br>
          ⋆ Витамин А и изотретиноин одновременно принимать <b>нельзя</b>
          </p>

<h3>И еще одна важная вещь:</h3>

          <div class="info-box">
          <p>
          Наружный ретиноид <b>≠</b> изотретиноин внутрь
          </p>
          </div>
          
          <p>          
          ・ У них совершенно разная степень системного воздействия, поэтому переносить
          противопоказания одного препарата на другой бездумно нельзя
          </p>

          <p>
          ・ Если ты принимаешь системный ретиноид, лучше сообщать врачу
          вообще обо всех БАДах, включая средства для похудения, спортивные комплексы
          и витаминные добавки
          </p>

<h2>Главное правило</h2>
          <p>
          ✅ Смотрим на действующие вещества → потом на торговое название → сверяем составы
          → принимаем решение пить или нет
          </p>
          
          <div class="info-box">
          <p>
          Именно состав определяет взаимодействия, а не надпись «натуральный», «бьюти» или «жиросжигатель»
          </p>
          </div>
        `
        }
        ]
        },

/*--------------------------
          волосы
--------------------------*/  
      
      "care-hair": {

section: "care",
title: "Мысли о стрижке пугают, а расческа доводит до слез",
category: "забота о себе",
pages:  [
        {
heading: "Какие анализы сдавать в лабораториях и бюджетные средства для волос",
content:`

          <div class="info-box">
          <p>
          Если во время похудения ты замечаешь, что на расческе остается больше волос, они стали тоньше или
          буквально лезут во время мытья головы, не спеши покупать первые попавшиеся витамины для волос с маркетов
          </p>

          <p>
          Очень часто причина находится не в шампуне и даже не в коже головы, а в том, что происходит с организмом изнутри
          </p>
          </div>
          
          <img src="./images/hairbrush.jpg"
          alt="hair" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">        
          
<h2>❔ Какие могут быть причины?</h2>
          <p>
          ⋆ Одна из самых частых причин после быстрого похудения или длительного ограничения питания — <b>телогеновое 
          выпадение волос</b>
          </p>

          <p>
          ⋆ Волосяные фолликулы постоянно проходят разные фазы роста и при выраженном дефиците энергии, белка,
          некоторых микроэлементов, сильном стрессе или резком снижении веса часть волос раньше времени
          переходит в фазу покоя, а затем начинает выпадать
          <br>
          ⇨ и здесь есть неприятный момент:
          </p>
          
          <div class="info-box">    
          <p>
          Выпадение может начаться не сразу после похудения, а спустя несколько недель или даже месяцев
          после периода сильного дефицита
          </p>
          </div>
          
<h2>💊 Как на это влияют БАДы?</h2>
          <p>
          Если выпадение появилось после начала приема БАДов для похудения, не стоит автоматически считать, что
          он буквально портят волосы
          </p>

          <div class="info-box">
          БАДы снижают аппетит, поэтому на их фоне ты можешь незаметно начать получать
          значительно меньше энергии и питательных веществ
          <br>
          А если питание становится недостаточным – организм получает дополнительный стресс
          </div>
          
<h2>🧬 Какие анализы могут показать причину</h2>

<h3>✅ Белок</h3>
          <p>
          ✓ Волос состоит преимущественно из кератина, поэтому хроническое недостаточное потребление
          белка может способствовать ухудшению состояния волос
          </p>

<h3>✅ Железо</h3>
          <p>
          ✓ Особенно, если есть обильные кд, слабость или другие признаки возможного дефицита
          </p>

          <p>
          ✦ При этом не стоит самостоятельно пить железо просто потому, что "выпадают волосы", 
          сначала лучше проверить показатели крови и обсудить результаты с врачом
          </p>

<h3>✅ ТТГ, Т3, Т4 свободный</h3>
          <p>
          ✓ Нарушения функции щитовидной железы также могут сопровождаться выпадением волос
          </p>

<h3>✅ ОАК и биохимия</h3>
          <p>
          ✓ Врач может подобрать обследование в зависимости от питания, симптомов, кд,
          лекарств и других факторов
          </p>
          
<h2>🚑 В каких случаях стоит обращаться к специалисту?</h2>
<h3>Если выпадение очень сильное и появились:</h3>
          <p>
          ✧ Залысины
          <br>
          ✧ Зуд
          <br>
          ✧ Воспаление кожи головы
          <br>
          ✧ Волосы выпадают очагами
          </p>
          
          <div class="info-box">
          <p>
          ➡ То настоятельно рекомендуем записаться к дерматологу/трихологу, а не пытаться лечить это самостоятельно
          </p>
          </div>
        `
        },  
   
        {
heading: "Какие анализы сдавать в лабораториях и бюджетные средства для волос",
content:`          

<h2>🛠️ Если нужен косметический ремонт</h2>

          <div class="info-box">
          <p>
          Все рекомендации ниже проверены лично админками, можете доверять нашему выбору! ♡
          </p>
          </div>
          
<h2>１Никотиновая кислота</h2>

          <img src="./images/IMG_6227.jpg"
          alt="nikotinka" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h3>Что делает:</h3>
          <p>
          ・ Стимулирует микроциркуляцию и обмен веществ в волосяном мешочке,
          что способствует увеличению скорости роста волос
          <br>
          ・ Также обладает подсушивающим действием, помогая нормализации деятельности сальных желез
          </p>

<h3>Как пользоваться:</h3>
          <p>
          ・ Нанеси на чистую кожу головы, разделив волосы проборами
          <br>
          ・ Распредели по всей поверхности массирующими движениями
          <br>
          ・ Не смывай
          </p>

<h3>Рекомендуемый курс:</h3>
          <p>
          ・ 14 процедур, используй 1 раз в 2-3 дня
          <br>
          ・ Курс можно повторять 1 раз в 3 месяца
          </p>

<h2>𝟚 Кислотный пилинг для кожи головы</h2>

          <img src="./images/IMG_6228.jpg"
          alt="piling" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h3>Что делает:</h3>
          <p>
          ・ Эффективно удаляет загрязнения, избыток себума, ороговевшие
          частички кожи и остатки стайлинговых продуктов
          <br>
          ・ Также укрепляет корни волос, поддерживает здоровье кожи головы и
          стимулирует рост новых волос, придавая ощущение чистоты и свежести
          </p>

<h3>Как пользоваться:</h3> 
          <p>
          ・ Нанеси пилинг на влажную кожу головы
          <br>
          ・ Мягко помассируй
          <br>
          ・ Оставь на 2-3 минуты
          <br>
          ・ Тщательно смой водой и заверши процедуру мытьем своим
          шампунем
          <br>
          ・ Используй 1-2 раза в неделю
          </p>

<h2>𝟛 Масло розмарина</h2>

          <img src="./images/IMG_6229.jpg"
          alt="maslo" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h3>что делает:</h3> 
          <p>
          Улучшает кровообращение в области корней волос, что способствует увеличению
          количества питательных веществ, поступающих к волосяным фолликулам
          </p>

<h3>Как пользоваться:</h3>
          <p>
          ・ Нанеси несколько капель масла розмарина на ладони и равномерно распредели
          по влажным или сухим волосам, уделяя особое внимание кончикам и корням
          <br>
          ・ Легкими массажными движениями вотри масло в кожу головы и корни волос
          <br>
          ・ Массируй голову круговыми движениями пальцев около 3-5 минут, стимулируя кровообращение и активируя рост волос
          <br>
          ・ Оставь масло на волосах примерно на 30 минут
          <br>
          ・ Промой теплой водой с использованием своего шампуня
          </p>

<h3>Рекомендуемый курс:</h3> 
          <p>
          Применяй масло розмарина 1-2 раза в неделю для регулярного ухода за волосами
          </p>

<h3>Важная рекомендация:</h3> 
          <div class="info-box">
          <p>
          Перед первым применением проверь масло на небольшом участке кожи,
          чтобы исключить аллергическую реакцию
          </p>
          </div>

<h2>𝟜 Эсвицин</h2>

          <img src="./images/IMG_6230.jpg"
          alt="esvicin" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h3>Что делает:</h3> 
          <p>
          Останавливает выпадение волос, активизирует рост новых волос
          за счет активации спящих волосяных фолликул, обеспечивает выработку и регуляцию
          уровня ферментов кожи головы в пределах показателей здорового человека, что
          и восстанавливает рост волос
          </p>

<h3>Как пользоваться:</h3> 
          <p>
          ・ Смачивай лосьоном кожу головы один раз в день
          (можно на сухие или чуть влажные волосы)
          <br>
          ・ Не смывай
          </p>

<h3>Рекомендуемый курс:</h3> 
          <p>
          Не вызывает привыкания, поэтому применение не ограничено по времени
          </p>

<h2>𝟝 Маска для корней волос</h2>

          <img src="./images/IMG_6231.JPG"
          alt="maska" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h3>Что делает:</h3>
          <p>
          Обеспечивает улучшение кровообращения и лечебное действие, а цинк,
          салициловая BHA кислота, натуральные масла и эко-экстракты в составе дают не
          только хорошую активацию роста, но и глубокое восстановление волос
          </p>

<h3>Как пользоваться:</h3> 
          <p>
          ・ Нанеси на сухую кожу головы, равномерно распредели легкими массажными движениями
          <br>
          ・ Оставь на 10-20 минут
          <br>
          ・ Тщательно смой водой и воспользуйся своим шампунем
          </p>

<h3>Рекомендуемый курс:</h3>
          <p>
          Используй 1-2 раза в неделю, 1-3 месяца
          </p>

<h2>𝟞 Аппликатор для нанесения средств на кожу головы</h2>

          <img src="./images/IMG_6232.jpg"
          alt="applikator" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h3>Для чего:</h3> 
          <p>
          ・ Равномерно распределяет масла или сыворотки по всей коже головы,
          не оставляя жирных следов
          <br>
          ・ Также оснащен специальным дозатором, который контролирует
          количество используемого средства в зависимости от силы давления на него
          </p>

<h3>Как пользоваться:</h3>
          <p>
          ・ Открой силиконовую крышечку наверху аппликатора
          <br>
          ・ Залей нужное количество средства и закрой
          <br>
          ・ Регулируй количество наносимого средства,
          аккуратно надавливая на силиконовую крышку
          <br>
          ・ Массажными движениями распредели средство по всей коже головы
          </p>
        `
        },
   
        {
heading: "Какие анализы сдавать в лабораториях и бюджетные средства для волос",
content:`  

<h2>❌ Чего лучше не делать:</h2>
          <p>
          ✘ Не увеличивать дозу витаминов самостоятельно
          <br>
          ✘ Не пить витамины "на всякий случай"
          <br>
          ✘ Не покупать десяток БАДов одновременно
          <br>
          ✘ Не пытаться еще сильнее ограничивать питание
          <br>
          ✘ Не винить себя за выпадение волос
          </p>

          <p>
          ❗️ И особенно не стоит думать:
          </p>

          <div class="info-box">
          <i>– Но ведь я хорошо худею, значит надо просто перетерпеть</i>
          </div>

          <p>
          Если организм уже реагирует на дефицит выпадением волос – это не достижение
          и не показатель эффективности похудения
          <br>
          <b>Это симптом того, что организму может не хватать ресурсов</b>
          </p>
          
<h22>⤴️ Когда же начнется рост?</h2>
          <p>
          ➙ Если причиной действительно было телогеновое выпадение из-за дефицита питания,
          болезни или другого стресса, волосы обычно не восстанавливаются за несколько дней
          после того, как причина устранена
          </p>

          <p>
          ✧ Волосяному фолликулу нужно время, поэтому после нормализации питания и устранения
          причины выпадение может сохраняться некоторое время, а затем постепенно уменьшаться
          </p>

          <p>
          ✧ Восстановление густоты тоже занимает довольно длительное, но индивидуальное время,
          потому что волосы у разных людей растут в исключительно разной скорости
          </p>

          <img src="./images/haircut.JPG"
          alt="hair" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">
          
<h2> 🖇 Самое важное</h2>
          <p>
            ⃠ Волосы не являются отдельным организмом, который можно "починить" только маской
          </p>

          <p>
          ➙ Если они начали массово выпадать на фоне похудения, особенно быстрого, 
          длительного или сопровождающегося выраженным ограничением питания, лучше воспринимать 
          это как повод посмотреть на состояние всего организма
          </p>
          
          <div class="info-box">  
          <p>
          Иногда самый полезный препарат для волос — не очередная капсула за 1999 рублей,
          а достаточное питание, лечение выявленного дефицита и прекращение того фактора,
          который организм воспринимает как стресс
          </p>
          </div>
          
          <img src="./images/longhair.JPG"
          alt="hair" 
          style="width: 100%; height: auto; border-radius: 12px; margin: 15px 0; display: block;">          
        `
        }
        ]
        }
        };

/* ==================================================
              СОСТОЯНИЕ ПРИЛОЖЕНИЯ
================================================== */

let currentSectionId = null;

let currentPage = 0; 

let selectedMood = "😊";

const moodStorageKey = "molecule-space-mood-diary";

const themeStorageKey = "molecule-space-theme";

/* ==================================================
                      DOM
================================================== */

const homeScreen = document.getElementById("homeScreen");

const contentScreen = document.getElementById("contentScreen");

const contentContainer = document.getElementById("contentContainer");

const quoteElement = document.getElementById("quote");

const newQuoteButton = document.getElementById("newQuote");

const themeToggle = document.getElementById("themeToggle");

const themeToggleIcon = document.getElementById("themeToggleIcon");

const quickDiaryButton = document.getElementById("quickDiaryButton");

/* ==================================================
               МОТИВАЦИОННЫЕ ЦИТАТЫ
================================================== */

function showNextQuote() {

currentQuote++;

if (currentQuote >= quotes.length) {
                 currentQuote = 0; }
quoteElement.style.opacity = "0";

setTimeout(() => {
quoteElement.textContent = quotes[currentQuote];
quoteElement.style.opacity = "1";
                 }, 120);
                          }

/* ==================================================
                        ТЕМА
================================================== */

function applyTheme(theme) {

const validThemes = [
"pink",
"angel",
"dark",
"minimalism"
                    ];

if (!validThemes.includes(theme)) {
                  theme = "pink"; }

  /* убираем старые классы тем */

validThemes.forEach(themeName => {

document.body.classList.remove(
         `theme-${themeName}` );
                                 });

  /* добавляем выбранную тему */

document.body.classList.add(
          `theme-${theme}` );

  /* иконка оставляет смысл кнопки:
     сама кнопка теперь открывает выбор темы */

if (themeToggleIcon) {
themeToggleIcon.textContent =
theme === "dark"
    ? "☾" 
    : "♡", "✦", "?"; }

   

if (themeToggle) {
themeToggle.setAttribute(
   "aria-label",
   "выбрать оформление" );
                 }

try {
localStorage.setItem(
themeStorageKey,
theme );
    } catch (error) {}

/* цвет интерфейса Telegram */

if (tg) {

const colors = {
dark: "#071426",
pink: "#c297b9",
angel: "#97acc2",
minimalism: "#c6cacf"
               };

if (tg.setHeaderColor) {
tg.setHeaderColor(
   colors[theme] );
                       }

if (tg.setBackgroundColor) {
tg.setBackgroundColor(
       colors[theme] );
                           }
                           }
                           }

function initTheme() {

let saved = "pink";
try {
saved =
localStorage.getItem(
    themeStorageKey ) || "pink";
    } catch (error) {}

applyTheme(saved);
                     }

/* ==================================================
                      ДНЕВНИК
================================================== */

function getMoodEntries() {
try {
return JSON.parse(localStorage.getItem(moodStorageKey) || "[]");
    } catch (error) {
return [];
                    }
                    }

function saveMoodEntry(text, mood) {
const entries = getMoodEntries();
entries.unshift({
    id: Date.now(),
      mood,
      text,
      date: new Date().toLocaleString("ru-RU", {
      day: "2-digit", month: "long", year: "numeric",
      hour: "2-digit", minute: "2-digit"
                                        })
               });

try {
localStorage.setItem(moodStorageKey, JSON.stringify(entries.slice(0, 100)));
    } catch (error) {}
                                   }

function renderMoodJournal() {
const entries = getMoodEntries();
const moods = ["😊", "🥳", "🥰", "😕", "😣", "😭", "😡", "🫩", "🤒"];

contentContainer.innerHTML = `
          <div class="screen-inner diary-page fade-in">

          <button
          class="back-button"
          id="diaryBackButton"
          >
          ← вернуться в меню
          </button>

          <header class="section-header">
          <p class="section-kicker">mood journal</p>

<h1>
дневник настроения
</h1>

          <p>
          место для коротких заметок о своем состоянии и событиях дня ♡
          </p>
          </header>

          <section class="diary-compose">

          <p class="diary-date">
          сегодня · ${new Date().toLocaleDateString("ru-RU", {
            day: "numeric",
            month: "long"
                    })}
          </p>

          <div
          class="mood-picker"
          aria-label="какое у тебя настроение?"
          >
          ${moods.map(mood => `
          <button
          type="button"
          class="mood-choice ${selectedMood === mood ? "selected" : ""}"
          data-mood="${mood}"
          >
          ${mood}
          </button>
          `).join("")
          }
          </div>

          <textarea
          class="diary-textarea"
          id="diaryText"
          placeholder="что хочется записать?"
          ></textarea>

          <button
          type="button"
          class="calculator-button diary-save"
          id="saveDiaryButton"
          >
          записать
          </button>

          </section>

          <div class="diary-list">

          ${
          entries.length
          ? entries.map((entry, index) => `
          < class="mood-entry">

          <div class="mood-entry-head">
          <span class="mood-entry-emoji">
          ${entry.mood}
          </span>

          <span class="mood-entry-date">
          ${entry.date}
          </span>
          </div>

          <p class="mood-entry-text">
          ${escapeHtml(entry.text)}
          </p>

          <button
          type="button"
          class="diary-delete-button"
          data-delete-entry="${index}"
          >
          удалить
          </button>

          </>
          `).join("")
          : `
          
          <div class="diary-empty">
          здесь появятся твои записи<br>
          они бережно хранятся только в этом приложении
          </div>
          `
        }

          </div>

          </div>
        `;

document
    .getElementById("diaryBackButton")
    .addEventListener("click", showHome);


document
    .querySelectorAll("[data-mood]")
    .forEach(button => {

button.addEventListener("click", () => {

selectedMood = button.dataset.mood;

renderMoodJournal();
                              });
                });

document
    .getElementById("saveDiaryButton")
    .addEventListener("click", () => {

const textarea =
document.getElementById("diaryText");

const text =
textarea.value.trim();

if (!text) {
textarea.focus();
return;
           }

saveMoodEntry(
text,
selectedMood
             );

selectedMood = "😊";

renderMoodJournal();
  });

document
    .querySelectorAll("[data-delete-entry]")
    .forEach(button => {

button.addEventListener("click", () => {

const index =
Number(button.dataset.deleteEntry);

const entries =
getMoodEntries();

entries.splice(index, 1);

try {
localStorage.setItem(
moodStorageKey,
JSON.stringify(
entries.slice(0, 100)
              )
                    );
    } catch (error) {}

renderMoodJournal();
                     });

                     });

  window.scrollTo(0, 0);
                      }

function escapeHtml(value) {
return String(value)
    .replace(/&/g, "&amp;")
    .replace(/</g, "&lt;")
    .replace(/>/g, "&gt;")
    .replace(/\"/g, "&quot;")
    .replace(/'/g, "&#039;");
                           }

function renderTools() {
contentContainer.innerHTML = `
          <div class="screen-inner fade-in">
          <button class="back-button" id="toolsBackButton">← назад</button>
          <header class="section-header">
          <p class="section-kicker">dietary calculations</p>
<h1>твой виртуальный счетовод</h1>
          <p>минималистичные калькуляторы с небольшим пояснением результата</p>
          </header>

          <div class="calculator-list">
          <section class="calculator-card">
<h3>ИМТ</h3>
          <p>индекс массы тела по росту и массе</p>
          <div class="calculator-grid">
          <div class="calculator-field"><label for="bmiWeight">масса, кг</label><input class="calculator-input" id="bmiWeight" type="number" min="1" step="0.1" inputmode="decimal"></div>
          <div class="calculator-field"><label for="bmiHeight">рост, см</label><input class="calculator-input" id="bmiHeight" type="number" min="1" step="1" inputmode="numeric"></div>
          </div>
          <button class="calculator-button" id="calculateBmi">рассчитать ИМТ</button>
          <div class="calculator-result" id="bmiResult">введи данные выше</div>
          </section>

          <section class="calculator-card">
<h3>норма и дефицит калорий</h3>
          <p>оценка суточной нормы сжигаемых тобой калорий и дефицит калорий по формуле Миффлина — Сан Жеора</p>
          <div class="calculator-grid">
          <div class="calculator-field"><label for="calAge">возраст, лет</label><input class="calculator-input" id="calAge" type="number" min="12" step="1" inputmode="numeric"></div>
          <div class="calculator-field"><label for="calWeight">масса, кг</label><input class="calculator-input" id="calWeight" type="number" min="1" step="0.1" inputmode="decimal"></div>
          <div class="calculator-field"><label for="calHeight">рост, см</label><input class="calculator-input" id="calHeight" type="number" min="1" step="1" inputmode="numeric"></div>
          <div class="calculator-field"><label for="calSex">пол для формулы</label><select class="calculator-input" id="calSex"><option value="female">женский</option><option value="male">мужской</option></select></div>
          <div class="calculator-field full"><label for="calActivity">уровень активности</label><select class="calculator-input" id="calActivity"><option value="1.2">минимальная активность(сидячий образ жизни)</option><option value="1.375">легкая активность(физнагрузка 1-3 раз в неделю)</option><option value="1.55">умеренная активность(физнагрузка 3-5 раз в неделю)</option><option value="1.725">высокая активность(физнагрузка 6-7 раз в неделю)</option><option value="1.9">очень высокая активность(ежедневная физнагрузка)</option></select></div>
          </div>
          <button class="calculator-button" id="calculateEnergy">рассчитать ИМТ</button>
          <div class="calculator-result" id="energyResult">введи данные выше</div>
          </section>
          </div>
          </div>
         `;

  document.getElementById("toolsBackButton").addEventListener("click", showHome);
  document.getElementById("calculateBmi").addEventListener("click", calculateBmi);
  document.getElementById("calculateEnergy").addEventListener("click", calculateEnergy);
  window.scrollTo(0, 0);
         }

function calculateBmi() {
const weight = Number(document.getElementById("bmiWeight").value);
const heightCm = Number(document.getElementById("bmiHeight").value);
const result = document.getElementById("bmiResult");
   
if (!weight || !heightCm || weight <= 0 || heightCm <= 0) { result.textContent = "пожалуйста, введи массу и рост"; return; }
const bmi = weight / Math.pow(heightCm / 100, 2);
result.innerHTML = `<strong>твой ИМТ: ${bmi.toFixed(1)}</strong>`; }

function calculateEnergy() {
const age = Number(document.getElementById("calAge").value);
const weight = Number(document.getElementById("calWeight").value);
const height = Number(document.getElementById("calHeight").value);
const sex = document.getElementById("calSex").value;
const activity = Number(document.getElementById("calActivity").value);
const result = document.getElementById("energyResult");
   
if (!age || age < 13 || !weight || !height) { result.textContent = "УПС! твой возраст ниже 13, твой организм еще растет и тебе не нужен дефицит"; return; }
const bmr = 10 * weight + 6.25 * height - 5 * age + (sex === "male" ? 5 : -161);
const tdee = (bmr * activity) - 400;
result.innerHTML = `<strong>твой средний обмен веществ за сутки без учета активности: ${Math.round(bmr)} ккал/сутки</strong><br>твой идельный дефицит калорий (20% от суточной нормы): ${Math.round(tdee)} ккал/сутки`; }


/* ==================================================
                 ПОКАЗАТЬ ГЛАВНУЮ
================================================== */

function showHome() {

  currentSectionId = null;
  currentId = null;
  currentPage = 0;


  const Overlay =
    document.getElementById("Overlay");

  if (Overlay) {
    Overlay.remove();
  }


  const sectionOverlay =
    document.getElementById("sectionOverlay");

  if (sectionOverlay) {
    sectionOverlay.remove();
  }


  document.body.style.overflow = "";


  contentScreen.classList.add("hidden");

  homeScreen.classList.remove("hidden");


  window.scrollTo(0, 0);

}

/* ==================================================
   ОТКРЫТЬ РАЗДЕЛ
================================================== */

function openSection(sectionId) {

  const section = sections[sectionId];

  if (!section) {
    return;
  }


  /* удаляем старый экран раздела */

  const oldOverlay =
    document.getElementById("sectionOverlay");

  if (oldOverlay) {
    oldOverlay.remove();
  } 

/*--------------- особые разделы -----------------*/   

/* ==================================================
                дневник настроения
================================================== */
   
if (sectionId === "mood") {

currentSectionId = "mood";
currentId = null;
currentPage = 0;

const overlay =
document.createElement("div");

overlay.id = "sectionOverlay";
overlay.className = "section-overlay";

document.body.appendChild(overlay);

const entries = getMoodEntries();

            overlay.innerHTML = `
          <div class="section-overlay-inner">
          <div class="screen-inner diary-page fade-in">

          <button
          class="back-button"
          id="diaryBackButton"
          >
          ← вернуться в меню
          </button>

          <header class="section-header">

          <p class="section-kicker">
          mood journal
          </p>

<h1>
дневник настроения
</h1>

          <p>
          место для коротких заметок о своем состоянии и событиях дня ♡ 
          </p>

          </header>

          <section class="diary-compose">

          <p class="diary-date">
          сегодня · ${new Date().toLocaleDateString(
          "ru-RU",
          {
            day: "numeric",
            month: "long"
          }
         )}
          </p>

          <div
          class="mood-picker"
          aria-label="Выбрать настроение"
          >

          ${[
              "😊",
              "🥳",
              "🥰",
              "😕",
              "😣",
              "😭",
              "😡",
              "🫩",
              "🤒"
          ].map(mood => `
          <button
          type="button"
          class="mood-choice ${
          selectedMood === mood
                    ? "selected"
                    : ""
                              }"
          data-mood="${mood}"
          >
          ${mood}
          </button>
          `).join("")       
          }

          </div>

          <textarea
          class="diary-textarea"
          id="diaryText"
          placeholder="какие есть мысли?"
          ></textarea>

          <button
          type="button"
          class="calculator-button diary-save"
          id="saveDiaryButton"
          >
          записать
          </button>

          </section>

          <div class="diary-list">

          ${
          entries.length
          ? entries.map((entry, index) => `
          <article class="mood-entry">

          <div class="mood-entry-head">

          <span class="mood-entry-emoji">
          ${entry.mood}
          </span>

          <span class="mood-entry-date">
          ${entry.date}
          </span>

          </div>

          <p class="mood-entry-text">
          ${escapeHtml(entry.text)}
          </p>

          <button
          type="button"
          class="diary-delete-button"
          data-delete-entry="${index}"
          >
          удалить
          </button>

          </article>
          `).join("")
          : `
          <div class="diary-empty">
          здесь появятся твои записи<br>
          они бережно хранятся только в этом приложении
          </div>
          `
          }

          </div>

          </div>

          </div>
          `;


          /* назад */

overlay
    .querySelector("#diaryBackButton")
    .addEventListener(
      "click",
      showHome
                     );

          /* выбор настроения */

overlay
    .querySelectorAll("[data-mood]")
    .forEach(button => {

button.addEventListener(
"click",
() => {

selectedMood =
button.dataset.mood;

openSection("mood");
                    }
                    );
                   });

  /* сохранить запись */

  overlay
    .querySelector("#saveDiaryButton")
    .addEventListener(
      "click",
      () => {

const textarea =
          overlay.querySelector("#diaryText");

const text =
          textarea.value.trim();

if (!text) {
textarea.focus();
return;
           }

saveMoodEntry(
text,
selectedMood
            );

selectedMood = "😊";

openSection("mood");
            }
            );

  /* удалить запись */

  overlay
    .querySelectorAll("[data-delete-entry]")
    .forEach(button => {

      button.addEventListener(
        "click",
        () => {

const index =
            Number(
              button.dataset.deleteEntry
            );

const entries =
            getMoodEntries();

          entries.splice(index, 1);

try {
localStorage.setItem(
moodStorageKey,
JSON.stringify(
entries.slice(0, 100)
              )
                    );
    } catch (error) {}

openSection("mood");
                    }
                    );
                   });

document.body.style.overflow = "hidden";
return;
}

/* ================================================
               ОФИЦИАЛЬНЫЕ ССЫЛКИ
================================================ */

if (sectionId === "links") {

currentSectionId = "links";
currentArticleId = null;
currentPage = 0;

const overlay =
      document.createElement("div");

overlay.id = "sectionOverlay";
overlay.className = "section-overlay";

      document.body.appendChild(overlay);

overlay.innerHTML = `
          <div class="section-overlay-inner">

          <div class="screen-inner fade-in">

          <button
          class="back-button"
          id="linksBackButton"
          >
          ← вернуться в меню
          </button>

          <header class="section-header">

          <p class="section-kicker">
          official resources
          </p>

<h1>
все ссылки
</h1>

          </header>

          <div class="official-links">

          <a
          class="official-link-card"
          href="https://t.me/+8m49Mte-Um5lMGUy"
          target="_blank"
          rel="noopener noreferrer"
          >
          <div class="official-link-icon">✦</div>

          <div class="official-link-info">
          <strong>основной Telegram-канал</strong>
          <span>
          публикуем новые артикулы ежедневно
          </span>
          </div>

          <span class="official-link-arrow">→</span>
          </a>


          <a
          class="official-link-card"
          href="https://t.me/+77xMDKXa0Zk3MTIy"
          target="_blank"
          rel="noopener noreferrer"
          >
          <div class="official-link-icon">☁</div>

          <div class="official-link-info">
          <strong>общий чат</strong>
          <span>
          самый лояльный чат, где тебя поддержат и помогут
          </span>
          </div>

          <span class="official-link-arrow">→</span>
          </a>


          <a
          class="official-link-card"
          href="https://t.me/+v9wqv4HaBlIxNjBi"
          target="_blank"
          rel="noopener noreferrer"
          >
          <div class="official-link-icon">♡</div>

          <div class="official-link-info">
          <strong>канал с информацией</strong>
          <span>
          не менее важный и информативный тгк
          </span>
          </div>

          <span class="official-link-arrow">→</span>
          </a>


          <a
          class="official-link-card"
          href="https://t.me/anonaskbot?start=molecule"
          target="_blank"
          rel="noopener noreferrer"
          >
          <div class="official-link-icon">?</div>

          <div class="official-link-info">
          <strong>анонимный бот</strong>
          <span>
          задай вопрос или предложи тему для поста
          </span>
          </div>

          <span class="official-link-arrow">→</span>
          </a>


          <a
          class="official-link-card"
          href="https://www.tiktok.com/@arttmolecule1?_r=1"
          target="_blank"
          rel="noopener noreferrer"
          >
          <div class="official-link-icon">♪</div>

          <div class="official-link-info">
          <strong>TikTok</strong>
          <span>
          тикитоки, шутки, сотрудничество
          </span>
          </div>

          <span class="official-link-arrow">→</span>
          </a>


          <div class="official-links-warning">

          <div class="official-links-warning-title">
          ⚠ только официальные ссылки
          </div>

          <p>
          все ссылки в этом разделе — наши официальные соц.сети
          </p>

          <p>
          ссылки, которые не были опубликованы здесь – <b>мошеннические!</b>
          </p>

          </div>

          </div>

          </div>

          </div>
          `;

overlay
      .querySelector("#linksBackButton")
      .addEventListener(
        "click",
        showHome
                       );

document.body.style.overflow = "hidden";
return;
          }

/*================================================
                  калькуляторы
================================================*/

if (sectionId === "tools") {

currentSectionId = "tools";
currentArticleId = null;
currentPage = 0;

const overlay =
      document.createElement("div");

overlay.id = "sectionOverlay";
overlay.className = "section-overlay";

    document.body.appendChild(overlay);

overlay.innerHTML = `
          <div class="section-overlay-inner">
          <div id="sectionContent"></div>
          </div>
          `;

const sectionContent =
overlay.querySelector("#sectionContent");

sectionContent.innerHTML = `
          <div class="screen-inner fade-in">

          <button
          class="back-button"
          id="toolsBackButton"
          >
          ← вернуться в меню
          </button>

          <header class="section-header">

          <p class="section-kicker">
          dietary calculations
          </p>

<h1>
твой виртуальный счетовод
</h1>

          <p>
          минималистичные калькуляторы с небольшим пояснением результата
          </p>

          </header>

          <div class="calculator-list">

          <section class="calculator-card">

<h3>ИМТ</h3>

          <p>
          индекс массы тела по росту и массе
          </p>

          <div class="calculator-grid">

          <div class="calculator-field">

          <label for="bmiWeight">
          масса, кг
          </label>

          <input
          class="calculator-input"
          id="bmiWeight"
          type="number"
          min="1"
          step="0.1"
          inputmode="decimal"
          >

          </div>

          <div class="calculator-field">

          <label for="bmiHeight">
          рост, см
          </label>

          <input
          class="calculator-input"
          id="bmiHeight"
          type="number"
          min="1"
          step="1"
          inputmode="numeric"
          >

          </div>

          </div>

          <button
          class="calculator-button"
          id="calculateBmi"
          >
          рассчитать ИМТ
          </button>

          <div
          class="calculator-result"
          id="bmiResult"
          >
          введи данные выше
          </div>

          </section>


          <section class="calculator-card">

<h3>
норма и дефицит калорий
</h3>

          <p>
          оценка суточной нормы сжигаемых тобой калорий и дефицит калорий по формуле Миффлина — Сан Жеора
          </p>

          <div class="calculator-grid">

          <div class="calculator-field">
          
          <label for="calAge">
          возраст, лет
          </label>

          <input
          class="calculator-input"
          id="calAge"
          type="number"
          min="13"
          step="1"
          inputmode="numeric"
          >

          </div>
          
          <div class="calculator-field">

          <label for="calWeight">
          масса, кг
          </label>

          <input
          class="calculator-input"
          id="calWeight"
          type="number"
          min="1"
          step="0.1"
          inputmode="decimal"
          >

          </div>

          <div class="calculator-field">

          <label for="calHeight">
          рост, см
          </label>

          <input
          class="calculator-input"
          id="calHeight"
          type="number"
          min="1"
          step="1"
          inputmode="numeric"
          >

          </div>

          <div class="calculator-field">

          <label for="calSex">
          пол для формулы
          </label>

          <select
          class="calculator-input"
          id="calSex"
          >
          <option value="female">
          женский
          </option>
          <option value="male">
          мужской
          </option>
          </select>

          </div>

          <div class="calculator-field full">
          
          <label for="calActivity">
          уровень активности
          </label>

          <select
          class="calculator-input"
          id="calActivity"
          >
          <option value="1.2">
          минимальная активность(сидячий образ жизни)
          </option>
          <option value="1.375">
          легкая активность(физнагрузка 1-3 раз в неделю)
          </option>
          <option value="1.55">
          умеренная активность(физнагрузка 3-5 раз в неделю)
          </option>
          <option value="1.725">
          высокая активность(физнагрузка 6-7 раз в неделю)
          </option>
          <option value="1.9">
          очень высокая активность(ежедневная физнагрузка)
          </option>
          </select>

          </div>

          </div>

          <button
          class="calculator-button"
          id="calculateEnergy"
          >
          рассчитать
          </button>

          <div
          class="calculator-result"
          id="energyResult"
          >
          введи данные выше
          </div>

          </section>

          </div>

          </div>
          `;


    document
      .getElementById("toolsBackButton")
      .addEventListener(
        "click",
        showHome
      );

    document
      .getElementById("calculateBmi")
      .addEventListener(
        "click",
        calculateBmi
      );

    document
      .getElementById("calculateEnergy")
      .addEventListener(
        "click",
        calculateEnergy
      );
    return;
      }


/* ================================================
                 ОБЫЧНЫЕ РАЗДЕЛЫ
  ================================================ */
   
  currentSectionId = sectionId;
  currentArticleId = null;
  currentPage = 0;


  const overlay =
    document.createElement("div");

  overlay.id = "sectionOverlay";

  overlay.className =
    "section-overlay";


  overlay.innerHTML = `

    <div class="section-overlay-inner">

      <button
        class="back-button"
        id="sectionBackButton"
      >
        ← вернуться в меню
      </button>


      <header class="section-header">

        <p class="section-kicker">
          ${section.kicker}
        </p>

        <h1>
          ${section.title}
        </h1>

        <p>
          ${section.description}
        </p>

      </header>


      <div class="topic-list">

        ${section.topics.map(topic => `

          <button
            class="topic-card"
            data-article="${topic.id}"
          >

            <div class="topic-card-content">

              <p class="topic-card-title">
                ${topic.title}
              </p>

              <p class="topic-card-description">
                ${topic.description}
              </p>

            </div>

            <span class="topic-arrow">
              ›
            </span>

          </button>

        `).join("")}

      </div>

    </div>

  `;


  document.body.appendChild(overlay);


  document.body.style.overflow =
    "hidden";


  document
    .getElementById("sectionBackButton")
    .addEventListener(
      "click",
      showHome
    );
}

/* ==================================================
   ОТКРЫТИЕ СТАТЬИ
================================================== */

function openArticle(articleId) {

  if (!articles[articleId]) {
    return;
  }

  currentArticleId = articleId;
  currentPage = 0;

  renderArticle();

}

/* ==================================================
   РЕНДЕР СТРАНИЦЫ СТАТЬИ
================================================== */

function renderArticle() {

  const article =
    articles[currentArticleId];

  if (!article) {
    return;
  }

  const page =
    article.pages[currentPage];

  const totalPages =
    article.pages.length;

  const isFirstPage =
    currentPage === 0;

  const isLastPage =
    currentPage === totalPages - 1;


  /* удаляем старое окно статьи */

  const oldOverlay =
    document.getElementById("articleOverlay");

  if (oldOverlay) {
    oldOverlay.remove();
  }


  /* создаем настоящее отдельное окно */

  const overlay =
    document.createElement("div");

  overlay.id = "articleOverlay";

  overlay.className =
    "article-overlay";


  overlay.innerHTML = `

    <div class="article-overlay-inner">

      <button
        class="back-button"
        id="articleBackButton"
      >
        ← вернуться к разделам
      </button>


      <header class="article-header">

        <p class="article-category">
          ${article.category}
        </p>

        <h1 class="article-title">
          ${article.title}
        </h1>

      </header>


      <article class="article-content">

        <h2>
          ${page.heading}
        </h2>

        ${page.content}

      </article>


      <div class="article-navigation">

        <button
          class="article-nav-button ${isFirstPage ? "disabled" : ""}"
          id="previousButton"
        >
          ← назад
        </button>


        <button
          class="article-nav-button next ${isLastPage ? "disabled" : ""}"
          id="nextButton"
        >
          дальше →
        </button>

      </div>


      <p class="page-counter">
        ${currentPage + 1} / ${totalPages}
      </p>

    </div>

  `;


  /* добавляем НЕ в contentContainer,
     а прямо в body */

  document.body.appendChild(overlay);
overlay.style.position = "fixed";
overlay.style.top = "0";
overlay.style.left = "0";
overlay.style.right = "0";
overlay.style.bottom = "0";
overlay.style.width = "100vw";

     /* блокируем прокрутку страницы под статьей */

  document.body.style.overflow = "hidden";


  /* кнопка назад */

  document
    .getElementById("articleBackButton")
    .addEventListener(
      "click",
      goBackFromArticle
    );


  /* предыдущая страница */

  document
    .getElementById("previousButton")
    .addEventListener(
      "click",
      previousPage
    );


  /* следующая страница */

  document
    .getElementById("nextButton")
    .addEventListener(
      "click",
      nextPage
    );


  /* прокручиваем именно окно статьи */

  overlay.scrollTop = 0;

}


/* ==================================================
                  НАЗАД ИЗ СТАТЬИ
================================================== */

function goBackFromArticle() {

  const overlay =
    document.getElementById("articleOverlay");

  if (overlay) {
    overlay.remove();
  }

  document.body.style.overflow = "hidden";

  currentArticleId = null;
  currentPage = 0;

}

/* ==================================================
                 СЛЕДУЮЩАЯ СТРАНИЦА
================================================== */

function nextPage() {

  const article =
    articles[currentArticleId];

  if (!article) {
    return;
  }

  if (
    currentPage <
    article.pages.length - 1
  ) {

    currentPage++;

    renderArticle();

  }
}

/* ==================================================
                ПРЕДЫДУЩАЯ СТРАНИЦА
================================================== */

function previousPage() {

  if (currentPage > 0) {

    currentPage--;

    renderArticle();

  }
}


/* ==================================================
                   СОБЫТИЯ ГЛАВНОЙ
================================================== */

document.addEventListener("click", (event) => {

const sectionButton = event.target.closest("[data-section]");

if (sectionButton) {
const sectionId = sectionButton.dataset.section;

if (sectionId === "settings") {
return;
}

openSection(sectionId);
return;
}

const articleButton = event.target.closest("[data-article]");

if (articleButton) {
const articleId = articleButton.dataset.article;

openArticle(articleId);
return;
}
});


if (newQuoteButton) {
newQuoteButton.addEventListener(
    "click",
showNextQuote
);
}

if (themeToggle) {
themeToggle.addEventListener(
    "click",
() => {

const themes = [
"dark",
"pink",
"angel",
"minimalism"
               ];

let currentTheme =
localStorage.getItem(
themeStorageKey
) || "pink";

let currentIndex =
themes.indexOf(
currentTheme
);

if (currentIndex === -1) {
currentIndex = 0;
}

const nextIndex =
(currentIndex + 1) %
themes.length;

applyTheme(
themes[nextIndex]
          );
          }
          );
          }

if (quickDiaryButton) {
quickDiaryButton.addEventListener(
    "click",
() => openSection("mood")
                                 );
                                 }

initTheme();

document
  .getElementById("supplementsTrackerButton")
  ?.addEventListener("click", renderSupplementTracker);

document
  .getElementById("waterTrackerButton")
  ?.addEventListener("click", renderWaterTracker);

if (quoteElement) {
quoteElement.style.transition =
"opacity 0.12s ease";
}

const supplementStorageKey = "molecule-space-supplements";
const waterStorageKey = "molecule-space-water";
const waterGoalStorageKey = "molecule-space-water-goal";
const reminderStorageKey = "molecule-space-reminders";

function trackerDate(date = new Date()) {
   
const y = date.getFullYear();
const m = String(date.getMonth() + 1).padStart(2, "0");
const d = String(date.getDate()).padStart(2, "0");
return `${y}-${m}-${d}`;
}

function readLocal(key, fallback) {
try {
    const value = localStorage.getItem(key);
    return value ? JSON.parse(value) : fallback;
    } catch (error) {
    return fallback;
                    }
                    }

function writeLocal(key, value) {
try {
    localStorage.setItem(key, JSON.stringify(value));
    } catch (error) {}
                                }

function getSupplements() {
return readLocal(supplementStorageKey, []);
}

function saveSupplements(items) {
writeLocal(supplementStorageKey, items);
}

function getWaterGoal() {
  const value = Number(readLocal(waterGoalStorageKey, 2000));
  return Number.isFinite(value) && value >= 150 ? value : 2000;
}

function getWaterData() {
  return readLocal(waterStorageKey, {});
}

function getTodayWater() {
  return Number(getWaterData()[trackerDate()] || 0);
}

function setTodayWater(amount) {
  const data = getWaterData();
  data[trackerDate()] = Math.max(0, Math.round(amount));
  writeLocal(waterStorageKey, data);
}



function getSupplementTaken(supplement, date = trackerDate()) {
return Array.isArray(supplement.taken) && supplement.taken.includes(date);
}

function setSupplementTaken(id, date, value) {
   
const items = getSupplements();
const item = items.find(s => s.id === id);

if (!item) return;
item.taken = Array.isArray(item.taken) ? item.taken : [];
item.taken = value
    ? [...new Set([...item.taken, date])]
    : item.taken.filter(d => d !== date);

saveSupplements(items);
}

function calculateSupplementStreak() {
   
const items = getSupplements();

if (!items.length) return 0;

let streak = 0;

const date = new Date();
while (true) {
   
const key = trackerDate(date);
const complete = items.every(item => getSupplementTaken(item, key));
if (!complete) break;
streak++;
date.setDate(date.getDate() - 1);
  }

  return streak;
}

function refreshHomeTrackers() {
  const supplements = getSupplements();
  const streak = calculateSupplementStreak();

  const supplementSummary =
    document.getElementById("supplementsTrackerSummary");

  const streakElement =
    document.getElementById("supplementsStreak");

  const waterSummary =
    document.getElementById("waterTrackerSummary");

  const waterProgress =
    document.getElementById("waterMiniProgress");


  if (supplementSummary) {
    supplementSummary.textContent = supplements.length
      ? `${supplements.length} ${pluralize(
          supplements.length,
          "таблетка",
          "таблетки",
          "таблеток"
        )}  отметь сегодняшний прием`
      : "добавь свои таблетки и отмечай прием";
  }

  if (streakElement) {
    streakElement.textContent = `${streak} 🔥`;
  }

  const water = getTodayWater();
  const goal = getWaterGoal();
  const percent = Math.min(150, Math.round((water / goal) * 100));

  if (waterSummary) {
    waterSummary.textContent = `${water} мл из ${goal} мл`;
  }

  if (waterProgress) {
    waterProgress.style.width = `${percent}%`;
  };

}

function pluralize(number, one, few, many) {
  const n = Math.abs(number) % 100;

  if (n >= 11 && n <= 19) return many;

  const last = n % 10;

  if (last === 1) return one;
  if (last >= 2 && last <= 4) return few;

  return many;
}

function openTrackerOverlay(id, title, content) {
  const old = document.getElementById(id);

  if (old) old.remove();

  const overlay = document.createElement("div");

  overlay.id = id;
  overlay.className = "tracker-overlay";

  overlay.innerHTML = `
    <div class="tracker-modal fade-in">
      <button class="tracker-close" type="button" aria-label="вернуться в меню">×</button>
      <div class="tracker-modal-kicker">molecule tracker</div>
      <h2>${title}</h2>
      <div class="tracker-modal-content">${content}</div>
    </div>
  `;

  document.body.appendChild(overlay);
  document.body.style.overflow = "hidden";

  const close = () => {
    overlay.remove();
    document.body.style.overflow = "";
    refreshHomeTrackers();
  };

  overlay
    .querySelector(".tracker-close")
    .addEventListener("click", close);

  overlay.addEventListener("click", event => {
    if (event.target === overlay) close();
  });

  return overlay;
}

function renderSupplementTracker() {
   
const supplements = getSupplements();
const today = new Date();
const todayKey = trackerDate(today);
const stateKey = "molecule-space-supplement-calendar";
const savedState = readLocal(stateKey, {});

let selectedSupplementId =
savedState.selectedSupplementId ||
(supplements[0]?.id || "");

let calendarDate = new Date();

if (savedState.month) {
const savedDate = new Date(savedState.month);
   
if (!Number.isNaN(savedDate.getTime())) {
calendarDate = savedDate;
}
}

calendarDate.setDate(1);

const monthNames = [
          "январь",
          "февраль",
          "март",
          "апрель",
          "май",
          "июнь",
          "июль",
          "август",
          "сентябрь",
          "октябрь",
          "ноябрь",
          "декабрь"
          ];

const weekDays = [
          "пн",
          "вт",
          "ср",
          "чт",
          "пт",
          "сб",
          "вс"
          ];

const saveCalendarState = () => {
writeLocal(stateKey, {
selectedSupplementId,
month: calendarDate.toISOString()
});
 };

const getMonthCalendar = () => {
   
const year = calendarDate.getFullYear();
const month = calendarDate.getMonth();
const firstDay = new Date(year, month, 1);

let startDay = firstDay.getDay();

// JS считает воскресенье первым днем недели.
// Нам нужен понедельник.
startDay = startDay === 0 ? 6 : startDay - 1;

const daysInMonth =
new Date(year, month + 1, 0).getDate();

const cells = [];

// Пустые ячейки перед первым днем месяца.
for (let i = 0; i < startDay; i++) {
cells.push(`
<div class="supplement-calendar-day is-empty"></div>
`);
}

for (let day = 1; day <= daysInMonth; day++) {

const date = new Date(year, month, day);
const key = trackerDate(date);
const selectedSupplement =
        supplements.find(
        item => item.id === selectedSupplementId
                        );

const checked =
        selectedSupplement &&
        getSupplementTaken(selectedSupplement, key);

const isToday = key === todayKey;

cells.push(`
          <button
          class="supplement-calendar-day
          ${checked ? "is-done" : ""}
          ${isToday ? "is-today" : ""}"
          type="button"
          data-calendar-date="${key}"
          aria-label="${day} ${monthNames[month]}"
          >
          <span>${day}</span>
          ${checked ? '<i>☆</i>' : ""}
          </button>
          `);
          }

return cells.join("");
  };

const getSelectedSupplement = () =>
      supplements.find(
      item => item.id === selectedSupplementId
                      );

const selectedSupplement =
    getSelectedSupplement();

const calendar = getMonthCalendar();

const supplementOptions = supplements.length
? supplements
.map(
item => `
          <button
          type="button"
          class="supplement-selector ${
          item.id === selectedSupplementId
          ? "is-active"
          : ""
          }"
          data-select-supplement="${item.id}"
          >
          <span class="supplement-selector-icon">💊</span>

          <span class="supplement-selector-name">
          ${escapeHtml(item.name)}
          </span>

          ${
          item.id === selectedSupplementId
          ? '<span class="supplement-selector-check">☆</span>'
          : ""
          }
          </button>
          `
          )
          .join("")
          : `
          
          <div class="empty-tracker-state">
          <span>💊</span>
          <strong>пока здесь пусто</strong>
          <p>
          добавь БАД или препарат, который хочешь
          отслеживать ♡ 
          </p>
          </div>
          `;

const overlay = openTrackerOverlay(
"supplementTrackerOverlay",
          "календарь приема",
          `
          <div class="streak-banner">
          <div>
          <span>текущая серия</span>
          <strong>
          ${calculateSupplementStreak()} дней 🔥
          </strong>
          </div>

          <small>
          серия считается, когда все добавленные
          позиции отмечены за день
          </small>
          </div>

          ${
          supplements.length
          ? `
          
          <div class="tracker-section-heading">
          <span>что отслеживается</span>
          <small>${supplements.length} поз.</small>
          </div>

          <div class="supplement-selector-list">
          ${supplementOptions}
          </div>

          <div class="supplement-calendar-header">
          <button
          type="button"
          class="calendar-nav-button"
          id="supplementCalendarPrev"
          aria-label="предыдущий месяц"
          >
          ‹
          </button>

          <div class="supplement-calendar-month">
          <strong>
          ${monthNames[calendarDate.getMonth()]}
          </strong>

          <span>
          ${calendarDate.getFullYear()}
          </span>
          </div>

          <button
          type="button"
          class="calendar-nav-button"
          id="supplementCalendarNext"
          aria-label="следующий месяц"
          >
          ›
          </button>
          </div>

          <div class="supplement-calendar">
          <div class="supplement-calendar-weekdays">
          ${weekDays
          .map(
          day => `
          <span>${day}</span>
          `
          )
          .join("")}
          </div>

          <div class="supplement-calendar-grid">
          ${calendar}
          </div>
          </div>

          <div class="calendar-selected-info">
          ${
          selectedSupplement
          ? `
          <span>сейчас отмечаешь</span>
          <strong>
          ${escapeHtml(
          selectedSupplement.name
          )}
          </strong>
          `
          : ""
          }
          </div>
          `
          : ""
          }

          <div class="tracker-add-row">
          <input
          id="newSupplementName"
          type="text"
          maxlength="40"
          placeholder="введи название"
          autocomplete="off"
          >

          <button
          id="addSupplementButton"
          type="button"
          >
          + добавить
          </button>
          </div>

          ${
          supplements.length
          ? `
          <div class="tracker-manage-list">
          ${supplements
          .map(
          item => `
          <div class="tracker-manage-row">
          <span>
          ${escapeHtml(item.name)}
          </span>

          <button
          class="mini-delete"
          type="button"
          data-delete-supplement="${item.id}"
          >
          удалить
          </button>
          </div>
          `
          )
          .join("")}
          </div>
          `
          : ""
          }

          <div class="tracker-hint">
          выбери БАД сверху и нажимай на даты в календаре,
          чтобы отметить или снять прием
          <br>
          Отметки сохраняются только на этом устройстве!!
          </div>
          `
          );

// Переключение между БАДами
   
overlay
    .querySelectorAll("[data-select-supplement]")
    .forEach(button => {
button.addEventListener("click", () => {
selectedSupplementId =
button.dataset.selectSupplement;

        saveCalendarState();
        renderSupplementTracker();
});
});

// Предыдущий месяц
   
overlay
    .querySelector("#supplementCalendarPrev")
    ?.addEventListener("click", () => {
      calendarDate.setMonth(
      calendarDate.getMonth() - 1
                           );

      saveCalendarState();
      renderSupplementTracker();
});

// Следующий месяц
   
overlay
    .querySelector("#supplementCalendarNext")
    ?.addEventListener("click", () => {
      calendarDate.setMonth(
      calendarDate.getMonth() + 1
                           );

      saveCalendarState();
      renderSupplementTracker();
});

// Отметка даты
   
overlay
    .querySelectorAll("[data-calendar-date]")
    .forEach(button => {
      button.addEventListener("click", () => {
const date =
      button.dataset.calendarDate;

const item = getSupplements().find(
supplement =>
supplement.id === selectedSupplementId
                                  );

if (!item) return;

        setSupplementTaken(
          item.id,
          date,
          !getSupplementTaken(item, date)
                          );

        saveCalendarState();
        renderSupplementTracker();
});
});

// Удаление БАДа
   
overlay
    .querySelectorAll("[data-delete-supplement]")
    .forEach(button => {
      button.addEventListener("click", () => {
const id =
      button.dataset.deleteSupplement;

        saveSupplements(
        getSupplements().filter(
            item => item.id !== id
                               )
                               );

const remaining = getSupplements();

if (selectedSupplementId === id) {
selectedSupplementId =
remaining[0]?.id || "";
                                 }

        saveCalendarState();
        renderSupplementTracker();
});
});

// Добавление нового БАДа
   
const add = () => {
const input =

overlay.querySelector(
"#newSupplementName"
);

const name = input?.value.trim();
if (!name) return;

const items = getSupplements();

const newItem = {
          id: `${Date.now()}-${Math.random()
          .toString(16)
          .slice(2)}`,
          name,
          taken: []
          };

items.push(newItem);

    saveSupplements(items);

selectedSupplementId = newItem.id;

    saveCalendarState();
    renderSupplementTracker();
};

overlay
    .querySelector("#addSupplementButton")
    ?.addEventListener("click", add);

overlay
    .querySelector("#newSupplementName")
    ?.addEventListener("keydown", event => {
       
if (event.key === "Enter") {
add();
                           }
                           });
                           }

function renderWaterTracker() {

const water = getTodayWater();
const goal = getWaterGoal();
const percent = Math.min( 150,
Math.round((water / goal) * 100)
);

const overlay = openTrackerOverlay(
"waterTrackerOverlay",
          "трекер воды",
          `
          <div class="water-big-card">
          <div
          class="water-orb"
          style="--water-progress:${percent}%"
          >
          <span>${percent}%</span>
          </div>

          <div>
          <strong id="waterBigValue">${water} мл</strong>
          <small>из ${goal} мл сегодня</small>
          </div>
          </div>

          <div class="water-progress-track">
          <span style="width:${percent}%"></span>
          </div>

          <div class="water-buttons">
          <button type="button" data-water-add="100">
          +100 мл
          </button>

          <button type="button" data-water-add="150">
          +150 мл
          </button>
          
          <button type="button" data-water-add="200">
          +200 мл
          </button>

          <button type="button" data-water-add="250">
          +250 мл
          </button>        

          <button type="button" data-water-add="300">
          +300 мл
          </button>
        
          <button type="button" data-water-add="350">
          +350 мл
          </button>        
          </div>

          <div class="water-buttons">
          <button type="button" data-water-add="-100">
          −100 мл
          </button>

          <button type="button" data-water-add="-150">
          −150 мл
          </button>

          <button type="button" data-water-add="-200">
          −200 мл
          </button>

          <button type="button" data-water-add="-250">
          −250 мл
          </button>      

          <button type="button" data-water-add="-300">
          −300 мл
          </button> 

          <button type="button" data-water-add="-350">
          −350 мл
          </button>          
          </div>

          <div class="water-goal-row">
          <label for="waterGoalInput">
          дневная цель
          </label>

          <div>
          <input
          id="waterGoalInput"
          type="number"
          min="150"
          max="10000"
          step="50"
          value="${goal}"
          >
          <span>мл</span>
          </div>
          </div>

          <div class="tracker-hint">
          количество воды можно корректировать в течение дня ♡₊⋆ 
          </div>
          `
          );

const rerender = () => renderWaterTracker();

overlay
    .querySelectorAll("[data-water-add]")
    .forEach(button => {
button.addEventListener("click", () => {
        setTodayWater(
        getTodayWater() +
        Number(button.dataset.waterAdd)
);
        rerender();
});
});

overlay
    .querySelector("#waterGoalInput")
    ?.addEventListener("change", event => {
       
const value = Math.min(
10000,
Math.max(
100,
         Number(event.target.value) || 2000
        )
        );

         writeLocal(waterGoalStorageKey, value);
         rerender();
});
}


function openThemePicker() {
   
const themes = [
    {
      id: "dark",
      name: "темная",
      description: "спокойная темная тема"
    },
    {
      id: "pink",
      name: "розовая",
      description: "мягкая розовая тема"
    },
    {
      id: "angel",
      name: "angel",
      description: "светлая воздушная тема"
    },
    {
      id: "minimalism",
      name: "минимализм",
      description: "чистая минималистичная тема"
    }
    ];

const currentTheme =
localStorage.getItem("molecule-space-theme") || "pink";

const overlay = openTrackerOverlay(
"themePickerOverlay",
          "тема приложения",
          `
          <div class="theme-picker-list">
          ${themes
          .map(
          theme => `
          <button
          type="button"
          class="theme-picker-option ${
          currentTheme === theme.id ? "is-active" : ""
          }"
          data-theme="${theme.id}"
          >
          <span class="theme-picker-check">
          ${currentTheme === theme.id ? "☆" : ""}
          </span>

          <span>
          <strong>${theme.name}</strong>
          <small>${theme.description}</small>
          </span>
          </button>
          `
          )
          .join("")}
          </div>
          `
          );

overlay
    .querySelectorAll("[data-theme]")
    .forEach(button => {
button.addEventListener("click", () => {
   
const theme = button.dataset.theme;

localStorage.setItem(
"molecule-space-theme",
theme
);

document.body.dataset.theme = theme;

renderThemeButtons?.();
overlay.remove();
document.body.style.overflow = "";
});
});
}

function escapeHtml(value) {
   
return String(value ?? "")
    .replaceAll("&", "&amp;")
    .replaceAll("<", "&lt;")
    .replaceAll(">", "&gt;")
    .replaceAll('"', "&quot;")
    .replaceAll("'", "&#039;");
}

function ensureTrackerCards() {
   
const diary =
document.getElementById("quickDiaryButton");

if (!diary ||
document.getElementById(
"supplementsTrackerButton"
                       )
                       ) {
return;
}

const wrap = document.createElement("div");
wrap.className = "home-trackers";
wrap.innerHTML = `
          <button
          class="tracker-card supplements-tracker-card"
          id="supplementsTrackerButton"
          type="button"
          >
          <span class="tracker-icon">💊</span>

          <span class="tracker-card-content">
          <strong>календарь приема</strong>
          <small id="supplementsTrackerSummary">
          отмечай прием и не потеряй огонек
          </small>
          </span>

          <span
          class="tracker-card-value"
          id="supplementsStreak"
          >
          0 🔥
          </span>
          </button>

          <button
          class="tracker-card water-tracker-card"
          id="waterTrackerButton"
          type="button"
          >
          <span class="tracker-icon">💧</span>

          <span class="tracker-card-content">
          <strong>вода</strong>
          <small id="waterTrackerSummary">
          0 мл из 2000 мл
          </small>
          </span>

          <span class="water-mini-bar">
          <span id="waterMiniProgress"></span>
          </span>
          </button>
          `;
   
  diary.insertAdjacentElement("afterend", wrap);
}

ensureTrackerCards();

const supplementsTrackerButton =
  document.getElementById(
    "supplementsTrackerButton"
  );

const waterTrackerButton =
  document.getElementById("waterTrackerButton");


supplementsTrackerButton?.addEventListener(
  "click",
  renderSupplementTracker
);

waterTrackerButton?.addEventListener(
  "click",
  renderWaterTracker
);

refreshHomeTrackers();
